 
# Yosys synthesis script for asym_ram_sdp_read_wider_dc
# Read source files
read_verilog -sv ${ROOT_PATH}/yosys/install/share/yosys/rapidsilicon/${ARCHITECTURE}/cell_sim_blackbox.v
read_verilog  -I${ROOT_PATH}/${RTL_PATH} ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/Bram_Design_suite//EDA-899/asym_ram_sdp_read_wider_dc.sv


# Technology mapping
hierarchy -top asym_ram_sdp_read_wider_dc



plugin -i synth-rs

synth_rs -tech ${SYNTH_SETTING}


write_verilog -noexpr -nodec ${TOP}_post_synth.v
