 
# Yosys synthesis script for accum_output_shifted
# Read source files
read_verilog -sv ${ROOT_PATH}/yosys/install/share/yosys/rapidsilicon/${ARCHITECTURE}/cell_sim_blackbox.v
read_verilog  -I${ROOT_PATH}/${RTL_PATH} ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/DSP_Designs/EDA-1455/accum_output_shifted/accum_output_shifted.sv

# Technology mapping
hierarchy -top accum_output_shifted

plugin -i synth-rs

synth_rs -tech ${SYNTH_SETTING}
write_blif accum_output_shifted_post_synth.blif

write_verilog -noexpr -nodec ${TOP}_post_synth.v
