 
# Yosys synthesis script for rams_sp_wf_rst_en_1024x16
# Read source files
verific -vlog-libext .v
verific -vlog-libext .sv
verific -vlog-define 
verific -vlog2k /nfs_scratch/scratch/FV/awais/Synthesis/yosys_verific_rs/RTL_Benchmark/Verilog/yosys_validation/EDA-713/rams_sp_wf_rst_en_1024x16.sv
verific -import rams_sp_wf_rst_en_1024x16


# Technology mapping
hierarchy -top rams_sp_wf_rst_en_1024x16



plugin -i synth-rs

synth_rs -tech genesis2 -top rams_sp_wf_rst_en_1024x16 -de -goal delay         -de_max_threads -1   

write_verilog -noexpr -nodec -norename rams_sp_wf_rst_en_1024x16_post_synth.v
write_blif rams_sp_wf_rst_en_1024x16_post_synth.blif

  