 
# Yosys synthesis script for rams_sp_wf_rst_en_1024x16
# Read source files
verific -vlog-libext .v
verific -vlog-libext .sv
verific -vlog-define 
verific -vlog2k ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/EDA-713/rams_sp_wf_rst_en_1024x16.sv
verific -import rams_sp_wf_rst_en_1024x16


# Technology mapping
hierarchy -top rams_sp_wf_rst_en_1024x16



plugin -i synth-rs

synth_rs -tech ${ARCHITECTURE} ${SYNTH_SETTING}
write_blif rams_sp_wf_rst_en_1024x16_post_synth.blif

  
write_verilog -noexpr -nohex ${TOP}_post_synth.v
