 
# Yosys synthesis script for rams_sp_wf_rst_en_1024x16
# Read source files
read_verilog  -I${ROOT_PATH}/${RTL_PATH} ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/EDA-713/rams_sp_wf_rst_en_1024x16.sv


# Technology mapping
hierarchy -top rams_sp_wf_rst_en_1024x16



plugin -i synth-rs

synth_rs -tech ${SYNTH_SETTING}
write_blif rams_sp_wf_rst_en_1024x16_post_synth.blif

  
write_verilog -noexpr -nodec ${TOP}_post_synth.v
