 
# Yosys synthesis script for rams_sp_reg_addr_readmem_1024x1
# Read source files
read_verilog -sv ${ROOT_PATH}/yosys/install/share/yosys/rapidsilicon/${ARCHITECTURE}/cell_sim_blackbox.v
verific -vlog2k /nfs_scratch/scratch/FV/awais/Synthesis/v1/yosys_verific_rs/RTL_Benchmark/Verilog/yosys_validation/EDA-1090/1024x1/rams_sp_reg_addr_readmem_1024x1.sv


# Technology mapping
hierarchy -top rams_sp_reg_addr_readmem_1024x1



plugin -i synth-rs

synth_rs -tech ${ARCHITECTURE} ${SYNTH_SETTING}
write_blif rams_sp_reg_addr_readmem_1024x1_post_synth.blif

write_verilog -noexpr -nodec ${TOP}_post_synth.v
