 
# Yosys synthesis script for Log2highacc
# Read source files
read_verilog  -I${ROOT_PATH}/${RTL_PATH} ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/EDA-402/EDA-402-komal/Log2highacc.sv


# Technology mapping
hierarchy -top Log2highacc



plugin -i synth-rs

synth_rs -tech ${SYNTH_SETTING}
write_blif Log2highacc_post_synth.blif
write_edif Log2highacc_post_synth.edif
write_verilog -noexpr -nodec ${TOP}_post_synth.v
