 
# Yosys synthesis script for matrix_mult_3x3
# Read source files
read -sv ${ROOT_PATH}/yosys/install/share/yosys/rapidsilicon/${ARCHITECTURE}/cell_sim_blackbox.v
verific -vlog-incdir ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/DSP_Designs/matrix_mult_3x3/ 
verific -vlog-libdir ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/DSP_Designs/matrix_mult_3x3/
verific -vlog-libext .v
verific -vlog-libext .sv
verific -vlog-define 
verific -vlog2k ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/DSP_Designs/matrix_mult_3x3/matrix_mult_3x3.sv
verific -import matrix_mult_3x3


# Technology mapping
hierarchy -top matrix_mult_3x3



plugin -i synth-rs

synth_rs -tech ${ARCHITECTURE} ${SYNTH_SETTING}
write_blif matrix_mult_3x3_post_synth.blif

  write_verilog -noexpr -nohex ${TOP}_post_synth.v
