 
# Yosys synthesis script for dsp_multiplier_accum_with_add_and_sub
# Read source files
read_verilog -sv ${ROOT_PATH}/yosys/install/share/yosys/rapidsilicon/${ARCHITECTURE}/cell_sim_blackbox.v
read_verilog  -I${ROOT_PATH}/${RTL_PATH} ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/DSP_Designs/dsp_multiplier_accum_with_add_and_sub/dsp_multiplier_accum_with_add_and_sub.sv


# Technology mapping
hierarchy -top dsp_multiplier_accum_with_add_and_sub



plugin -i synth-rs

synth_rs -tech ${SYNTH_SETTING}
write_blif dsp_multiplier_accum_with_add_and_sub_post_synth.blif

write_verilog -noexpr -nodec ${TOP}_post_synth.v
