 
# Yosys synthesis script for sync_sp_srst
# Read source files 
verific -vlog-libext .v
verific -vlog-libext .sv
verific -vlog-define 
verific -vlog2k ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/bram_tests/sync_sp_srst/sync_sp_srst.sv
verific -import sync_sp_srst


# Technology mapping
hierarchy -top sync_sp_srst


plugin -i synth-rs

synth_rs  -tech ${ARCHITECTURE} -top sync_sp_srst -de -goal delay -carry no        -de_max_threads -1   

write_verilog -noexpr -nodec ${TOP}_post_synth.v
write_blif sync_sp_srst_post_synth.blif

  
