 
# Yosys synthesis script for sync_sp_srst
# Read source files 
read_verilog  -I${ROOT_PATH}/${RTL_PATH} ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/bram_tests/sync_sp_srst/sync_sp_srst.sv


# Technology mapping
hierarchy -top sync_sp_srst


plugin -i synth-rs

synth_rs -tech ${SYNTH_SETTING}
write_blif sync_sp_srst_post_synth.blif

  
write_verilog -noexpr -nodec ${TOP}_post_synth.v
