 
# Yosys synthesis script for ram_simple_dp_sync_read_4096x32
# Read source files
verific -vlog-libext .v
verific -vlog-libext .sv
verific -vlog-define 
verific -vlog2k ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/EDA-629/EDA-629-1/ram_simple_dp_sync_read_4096x32.sv
verific -import ram_simple_dp_sync_read_4096x32


# Technology mapping
hierarchy -top ram_simple_dp_sync_read_4096x32



plugin -i synth-rs

synth_rs -tech ${ARCHITECTURE} -top ram_simple_dp_sync_read_4096x32 -de -goal delay         -de_max_threads -1   

write_verilog -noexpr -nodec -norename ram_simple_dp_sync_read_4096x32_post_synth.v
write_blif ram_simple_dp_sync_read_4096x32_post_synth.blif

  