 
# Yosys synthesis script for ram_simple_dp_sync_read_4096x32
# Read source files
read_verilog  -I${ROOT_PATH}/${RTL_PATH} ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/EDA-629/EDA-629-1/ram_simple_dp_sync_read_4096x32.sv


# Technology mapping
hierarchy -top ram_simple_dp_sync_read_4096x32



plugin -i synth-rs

synth_rs -tech ${ARCHITECTURE} ${SYNTH_SETTING}
write_blif ram_simple_dp_sync_read_4096x32_post_synth.blif

write_verilog -noexpr -nodec ${TOP}_post_synth.v
