 
# Yosys synthesis script for mul_and_reflect_input_B_as_registered_out
# Read source files
read_verilog -sv ${ROOT_PATH}/yosys/install/share/yosys/rapidsilicon/${ARCHITECTURE}/cell_sim_blackbox.v
read_verilog  -I${ROOT_PATH}/${RTL_PATH} ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/DSP_Designs/mul_and_reflect_input_B_as_registered_out/mul_and_reflect_input_B_as_registered_out.sv


# Technology mapping
hierarchy -top mul_and_reflect_input_B_as_registered_out



plugin -i synth-rs

synth_rs -tech ${SYNTH_SETTING}
write_blif mul_and_reflect_input_B_as_registered_out_post_synth.blif

write_verilog -noexpr -nodec ${TOP}_post_synth.v
