 
# Yosys synthesis script for ram_simple_dp_sync_reg_read_1024x64
# Read source files
# read -vlog2k rapidsilicon/${ARCHITECTURE}/cell_sim_blackbox.v
verific -vlog-incdir ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/ 
verific -vlog-libdir ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/
verific -vlog-libext .v
verific -vlog-libext .sv
verific -vlog-define 
verific -vlog2k ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/EDA-891/ram_simple_dp_sync_reg_read_1024x64.sv
verific -import ram_simple_dp_sync_reg_read_1024x64


# Technology mapping
hierarchy -top ram_simple_dp_sync_reg_read_1024x64



plugin -i synth-rs

synth_rs  -tech ${ARCHITECTURE} -top ram_simple_dp_sync_reg_read_1024x64 -de -goal delay -carry no -de_max_threads -1   

write_verilog -noexpr -nodec ${TOP}_post_synth.v
#write_blif ram_simple_dp_sync_reg_read_1024x64_post_synth.blif

  