 
# Yosys synthesis script for ram_simple_dp_sync_reg_read_1024x64
# Read source files
# read -vlog2k rapidsilicon/${ARCHITECTURE}/cell_sim_blackbox.v
read_verilog  -I${ROOT_PATH}/${RTL_PATH} ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/EDA-891/ram_simple_dp_sync_reg_read_1024x64.sv


# Technology mapping
hierarchy -top ram_simple_dp_sync_reg_read_1024x64



plugin -i synth-rs

synth_rs -tech ${ARCHITECTURE} ${SYNTH_SETTING}
#write_blif ram_simple_dp_sync_reg_read_1024x64_post_synth.blif

write_verilog -noexpr -nodec ${TOP}_post_synth.v
