 
# Yosys synthesis script for dsp_z_o_wrt_out_select_i
# Read source files
read -sv ${ROOT_PATH}/yosys/install/share/yosys/rapidsilicon/${ARCHITECTURE}/cell_sim_blackbox.v
verific -vlog-incdir ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/DSP_Designs/dsp_z_o_wrt_out_select_i/ 
verific -vlog-libdir ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/DSP_Designs/dsp_z_o_wrt_out_select_i/
verific -vlog-libext .v
verific -vlog-libext .sv
verific -vlog-define 
verific -vlog2k ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/DSP_Designs/dsp_z_o_wrt_out_select_i/dsp_z_o_wrt_out_select_i.sv
verific -import dsp_z_o_wrt_out_select_i


# Technology mapping
hierarchy -top dsp_z_o_wrt_out_select_i



plugin -i synth-rs

synth_rs -tech ${ARCHITECTURE} ${SYNTH_SETTING}
write_blif dsp_z_o_wrt_out_select_i_post_synth.blif

  write_verilog -noexpr -nohex ${TOP}_post_synth.v
