 
# Yosys synthesis script for dsp_z_o_wrt_out_select_i
# Read source files
read -sv ./../../../../../yosys/install/share/yosys/rapidsilicon/genesis2/cell_sim_blackbox.v
verific -vlog-incdir ./../../../../../RTL_Benchmark/Verilog/yosys_validation/DSP_Designs/dsp_z_o_wrt_out_select_i/ 
verific -vlog-libdir ./../../../../../RTL_Benchmark/Verilog/yosys_validation/DSP_Designs/dsp_z_o_wrt_out_select_i/
verific -vlog-libext .v
verific -vlog-libext .sv
verific -vlog-define 
verific -vlog2k ./../../../../../RTL_Benchmark/Verilog/yosys_validation/DSP_Designs/dsp_z_o_wrt_out_select_i/dsp_z_o_wrt_out_select_i.sv
verific -import dsp_z_o_wrt_out_select_i


# Technology mapping
hierarchy -top dsp_z_o_wrt_out_select_i



plugin -i synth-rs

synth_rs  -tech genesis2 -de -goal delay     -max_device_dsp 154 -max_device_bram 154    -de_max_threads -1   

write_verilog -noexpr -nodec -v dsp_z_o_wrt_out_select_i_post_synth.v
write_blif dsp_z_o_wrt_out_select_i_post_synth.blif

  