 
# Yosys synthesis script for instantiate_mul_in_accum
# Read source files
read_verilog -sv ${ROOT_PATH}/yosys/install/share/yosys/rapidsilicon/${ARCHITECTURE}/cell_sim_blackbox.v
read_verilog  -I${ROOT_PATH}/${RTL_PATH} ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/DSP_Designs/instantiate_mul_in_accum/instantiate_mul_in_accum.sv


# Technology mapping
hierarchy -top instantiate_mul_in_accum



plugin -i synth-rs

synth_rs -tech ${SYNTH_SETTING}
write_blif instantiate_mul_in_accum_post_synth.blif

write_verilog -noexpr -nodec ${TOP}_post_synth.v
