 
# Yosys synthesis script for instantiate_mul_in_accum
# Read source files
read -sv ./../../../../../yosys/install/share/yosys/rapidsilicon/genesis2/cell_sim_blackbox.v
verific -vlog-incdir ./../../../../../RTL_Benchmark/Verilog/yosys_validation/DSP_Designs/instantiate_mul_in_accum/ 
verific -vlog-libdir ./../../../../../RTL_Benchmark/Verilog/yosys_validation/DSP_Designs/instantiate_mul_in_accum/
verific -vlog-libext .v
verific -vlog-libext .sv
verific -vlog-define 
verific -vlog2k ./../../../../../RTL_Benchmark/Verilog/yosys_validation/DSP_Designs/instantiate_mul_in_accum/instantiate_mul_in_accum.sv
verific -import instantiate_mul_in_accum


# Technology mapping
hierarchy -top instantiate_mul_in_accum



plugin -i synth-rs

synth_rs  -tech genesis2 -de -goal delay     -max_device_dsp 154 -max_device_bram 154    -de_max_threads -1   

write_verilog -noexpr -nodec -v instantiate_mul_in_accum_post_synth.v
write_blif instantiate_mul_in_accum_post_synth.blif

  