 
# Yosys synthesis script for ram_true_reg_addr_dp_1024x8
# Read source files
read_verilog  -I${ROOT_PATH}/${RTL_PATH} ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/Bram_Design_suite/EDA-885/ram_true_reg_addr_dp_1024x8.sv


# Technology mapping
hierarchy -top ram_true_reg_addr_dp_1024x8



plugin -i synth-rs

synth_rs -tech ${SYNTH_SETTING}
write_blif ram_true_reg_addr_dp_1024x8_post_synth.blif

write_verilog -noexpr -nodec ${TOP}_post_synth.v
