 
# Yosys synthesis script for asym_ram_sdp_read_wider_dc
# Read source files
read -vlog2k ./../../../../../yosys/install/share/yosys/rapidsilicon/genesis2/cell_sim_blackbox.v
verific -vlog-libext .v
verific -vlog-libext .sv
verific -vlog-define 
verific -vlog2k ./../../../../../RTL_Benchmark/Verilog/yosys_validation/EDA-899/asym_ram_sdp_read_wider_dc.sv
verific -import asym_ram_sdp_read_wider_dc


# Technology mapping
hierarchy -top asym_ram_sdp_read_wider_dc



plugin -i synth-rs

synth_rs  -tech genesis2 -top asym_ram_sdp_read_wider_dc -de -goal delay -carry no        -de_max_threads -1   

write_verilog -noattr -nohex -norename -v asym_ram_sdp_read_wider_dc_post_synth.v


  