 
# Yosys synthesis script for asym_ram_sdp_read_wider_dc
# Read source files
read -sv ${ROOT_PATH}/yosys/install/share/yosys/rapidsilicon/${ARCHITECTURE}/cell_sim_blackbox.v
verific -vlog-libext .v
verific -vlog-libext .sv
verific -vlog-define 
verific -vlog2k ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/EDA-899/asym_ram_sdp_read_wider_dc.sv
verific -import asym_ram_sdp_read_wider_dc


# Technology mapping
hierarchy -top asym_ram_sdp_read_wider_dc



plugin -i synth-rs

synth_rs  -tech ${ARCHITECTURE} -top asym_ram_sdp_read_wider_dc -de -goal delay -carry no        -de_max_threads -1   

write_verilog -noattr -nohex -norename -v asym_ram_sdp_read_wider_dc_post_synth.v


  