 
# Yosys synthesis script for instantiate_adder_in_mult_and_shifted_input_design
# Read source files
read -sv ./../../../../../yosys/install/share/yosys/rapidsilicon/genesis2/cell_sim_blackbox.v
verific -vlog-incdir ./../../../../../RTL_Benchmark/Verilog/yosys_validation/DSP_Designs/instantiate_adder_in_mult_and_shifted_input_design/ 
verific -vlog-libdir ./../../../../../RTL_Benchmark/Verilog/yosys_validation/DSP_Designs/instantiate_adder_in_mult_and_shifted_input_design/
verific -vlog-libext .v
verific -vlog-libext .sv
verific -vlog-define 
verific -vlog2k ./../../../../../RTL_Benchmark/Verilog/yosys_validation/DSP_Designs/instantiate_adder_in_mult_and_shifted_input_design/instantiate_adder_in_mult_and_shifted_input_design.sv
verific -import instantiate_adder_in_mult_and_shifted_input_design


# Technology mapping
hierarchy -top instantiate_adder_in_mult_and_shifted_input_design



plugin -i synth-rs

synth_rs  -tech genesis2 -de -goal delay     -max_device_dsp 154 -max_device_bram 154    -de_max_threads -1   

write_verilog -noexpr -nodec -v instantiate_adder_in_mult_and_shifted_input_design_post_synth.v
write_blif instantiate_adder_in_mult_and_shifted_input_design_post_synth.blif

  