 
# Yosys synthesis script for asym_ram_sdp_wide_write
# Read source files
read_verilog -sv ${ROOT_PATH}/yosys/install/share/yosys/rapidsilicon/${ARCHITECTURE}/cell_sim_blackbox.v
read_verilog  -I${ROOT_PATH}/${RTL_PATH} ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/Bram_Design_suite/EDA-896/asym_ram_sdp_wide_write.sv


# Technology mapping
hierarchy -top asym_ram_sdp_wide_write



plugin -i synth-rs

synth_rs -tech ${SYNTH_SETTING}
#write_blif asym_ram_sdp_wide_write_post_synth.blif

write_verilog -noexpr -nodec ${TOP}_post_synth.v
