 
# Yosys synthesis script for add_shifted_input_to_the_mul_output
# Read source files
read -sv ${ROOT_PATH}/yosys/install/share/yosys/rapidsilicon/${ARCHITECTURE}/cell_sim_blackbox.v
verific -vlog-incdir ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/DSP_Designs/add_shifted_input_to_the_mul_output/ 
verific -vlog-libdir ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/DSP_Designs/add_shifted_input_to_the_mul_output/
verific -vlog-libext .v
verific -vlog-libext .sv
verific -vlog-define 
verific -vlog2k ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/DSP_Designs/add_shifted_input_to_the_mul_output/add_shifted_input_to_the_mul_output.sv
verific -import add_shifted_input_to_the_mul_output


# Technology mapping
hierarchy -top add_shifted_input_to_the_mul_output



plugin -i synth-rs

synth_rs -tech ${ARCHITECTURE} ${SYNTH_SETTING}
write_blif add_shifted_input_to_the_mul_output_post_synth.blif

  write_verilog -noexpr -nohex ${TOP}_post_synth.v
