 
# Yosys synthesis script for dct
# Read source files
read -sv ${ROOT_PATH}/yosys/install/share/yosys/rapidsilicon/${ARCHITECTURE}/cell_sim_blackbox.v
verific -vlog-incdir ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/DSP_Designs/dct/ 
verific -vlog-libdir ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/DSP_Designs/dct/
verific -vlog-libext .v
verific -vlog-libext .sv
verific -vlog-define 
verific -vlog2k ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/DSP_Designs/dct/dct.sv
verific -import dct


# Technology mapping
hierarchy -top dct



plugin -i synth-rs

synth_rs -tech ${ARCHITECTURE} ${SYNTH_SETTING}
write_blif dct_post_synth.blif

  write_verilog -noexpr -nohex ${TOP}_post_synth.v
