read -sv s38584.v GSCLib_3.0.v

synth -flatten -top s38584

#abc -lut 6
#abc -script abc6.scr
abc -script abc_base6.v1.scr
opt_clean

#write_verilog netlist.v

stat

