60000 train samples
10000 test samples
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense (Dense)                (None, 128)               100480    
_________________________________________________________________
dropout (Dropout)            (None, 128)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 64)                8256      
_________________________________________________________________
dropout_1 (Dropout)          (None, 64)                0         
_________________________________________________________________
dense_2 (Dense)              (None, 32)                2080      
_________________________________________________________________
dense_3 (Dense)              (None, 16)                528       
_________________________________________________________________
dense_4 (Dense)              (None, 32)                544       
_________________________________________________________________
dense_5 (Dense)              (None, 64)                2112      
_________________________________________________________________
dropout_2 (Dropout)          (None, 64)                0         
_________________________________________________________________
dense_6 (Dense)              (None, 10)                650       
=================================================================
Total params: 114,650
Trainable params: 114,650
Non-trainable params: 0
_________________________________________________________________
(10000, 784)
(4, 784)
[[-24.627508  -30.246864  -20.451105  -18.435604  -21.436897  -25.472689
  -28.866714    8.538939  -36.105785  -22.093906 ]
 [-27.56242   -47.02973     9.170985  -20.110716  -48.447334  -50.65312
  -61.242958  -22.395094  -29.388113  -34.523716 ]
 [-41.797768    7.31824   -15.338296  -24.574656  -16.356241  -28.517366
  -32.625538  -17.508242  -21.08763   -20.823975 ]
 [ 15.673646  -71.93045   -15.023145  -36.031307  -45.676743  -18.350279
  -20.018438  -12.036947  -44.007183  -14.5659895]]
