 
# Yosys synthesis script for dsp_add_mul_output_to_accum_20lsb
# Read source files
read_verilog -sv ${ROOT_PATH}/yosys/install/share/yosys/rapidsilicon/${ARCHITECTURE}/cell_sim_blackbox.v
read_verilog  -I${ROOT_PATH}/${RTL_PATH} ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/DSP_Designs/dsp_add_mul_output_to_accum_20lsb/dsp_add_mul_output_to_accum_20lsb.sv


# Technology mapping
hierarchy -top dsp_add_mul_output_to_accum_20lsb



plugin -i synth-rs

synth_rs -tech ${ARCHITECTURE} ${SYNTH_SETTING}
write_blif dsp_add_mul_output_to_accum_20lsb_post_synth.blif

write_verilog -noexpr -nodec ${TOP}_post_synth.v
