 
# Yosys synthesis script for dsp_add_mul_output_to_accum_20lsb
# Read source files
read -vlog2k ./../../../../../yosys/install/share/yosys/rapidsilicon/genesis2/cell_sim_blackbox.v
verific -vlog-incdir ./../../../../../RTL_Benchmark/Verilog/yosys_validation/DSP_Designs/dsp_add_mul_output_to_accum_20lsb/
verific -vlog-libdir ./../../../../../RTL_Benchmark/Verilog/yosys_validation/DSP_Designs/dsp_add_mul_output_to_accum_20lsb/
verific -vlog-libext .v
verific -vlog-libext .sv
verific -vlog-define 
verific -vlog2k ./../../../../../RTL_Benchmark/Verilog/yosys_validation/DSP_Designs/dsp_add_mul_output_to_accum_20lsb/dsp_add_mul_output_to_accum_20lsb.sv
verific -import dsp_add_mul_output_to_accum_20lsb


# Technology mapping
hierarchy -top dsp_add_mul_output_to_accum_20lsb



plugin -i synth-rs

synth_rs  -tech genesis2 -de -goal delay     -max_device_dsp 154 -max_device_bram 154    -de_max_threads -1   

write_verilog -noexpr -nodec -v dsp_add_mul_output_to_accum_20lsb_post_synth.v
write_blif dsp_add_mul_output_to_accum_20lsb_post_synth.blif

  