 
# Yosys synthesis script for rams_sp_re_we_rst_1024x32
# Read source files
read -sv ${ROOT_PATH}/yosys/install/share/yosys/rapidsilicon/${ARCHITECTURE}/cell_sim_blackbox.v
verific -vlog-incdir ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/EDA-1769/rams_sp_re_we_rst_1024x32/
verific -vlog-libdir ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/EDA-1769/rams_sp_re_we_rst_1024x32/
verific -vlog-libext .v
verific -vlog-libext .sv
verific -vlog-define 
verific -vlog2k ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/EDA-1769/rams_sp_re_we_rst_1024x32/rams_sp_re_we_rst_1024x32.sv
verific -import rams_sp_re_we_rst_1024x32


# Technology mapping
hierarchy -top rams_sp_re_we_rst_1024x32



plugin -i synth-rs

synth_rs -tech ${ARCHITECTURE} -de -goal delay -no_iobuf -max_device_dsp 176 -max_device_bram 176 -max_device_carry_length 528 -max_dsp 176 -max_bram 176 -max_carry_length 528     -de_max_threads -1   

write_verilog -noexpr -nodec ${TOP}_post_synth.v
write_blif rams_sp_re_we_rst_1024x32_post_synth.blif
