 
# Yosys synthesis script for async_big_block_reg
# Read source files 
verific -vlog-libext .v
verific -vlog-libext .sv
verific -vlog-define 
verific -vlog2k ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/bram_tests/async_big_block_reg/async_big_block_reg.sv
verific -import async_big_block_reg


# Technology mapping
hierarchy -top async_big_block_reg


plugin -i synth-rs

synth_rs  -tech ${ARCHITECTURE} -top async_big_block_reg -de -goal delay -carry no        -de_max_threads -1   

write_verilog -noexpr -nodec -norename async_big_block_reg_post_synth.v
write_blif async_big_block_reg_post_synth.blif

  
