 
# Yosys synthesis script for async_big_block_reg
# Read source files 
read_verilog  -I${ROOT_PATH}/${RTL_PATH} ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/bram_tests/async_big_block_reg/async_big_block_reg.sv


# Technology mapping
hierarchy -top async_big_block_reg


plugin -i synth-rs

synth_rs -tech ${SYNTH_SETTING}
write_blif async_big_block_reg_post_synth.blif

  
write_verilog -noexpr -nodec ${TOP}_post_synth.v
