 
# Yosys synthesis script for asym_ram_sdp_wide_sync_read_via_part_selection
# Read source files
read -vlog2k ./../../../../../yosys/install/share/yosys/rapidsilicon/genesis2/cell_sim_blackbox.v
verific -vlog-libext .v
verific -vlog-libext .sv
verific -vlog-define 
verific -vlog2k ./../../../../../RTL_Benchmark/Verilog/yosys_validation/EDA-720/asym_ram_sdp_wide_sync_read_via_part_selection.sv
verific -import asym_ram_sdp_wide_sync_read_via_part_selection


# Technology mapping
hierarchy -top asym_ram_sdp_wide_sync_read_via_part_selection



plugin -i synth-rs

synth_rs -tech genesis2 -top asym_ram_sdp_wide_sync_read_via_part_selection -de -goal delay         -de_max_threads -1   

write_verilog -noattr -nohex asym_ram_sdp_wide_sync_read_via_part_selection_post_synth.v


  