 
# Yosys synthesis script for dsp_mul_unsigned_comb
# Read source files
read -sv ${ROOT_PATH}/yosys/install/share/yosys/rapidsilicon/${ARCHITECTURE}/cell_sim_blackbox.v
verific -vlog-incdir ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/DSP_Designs/dsp_mul_unsigned_comb/ 
verific -vlog-libdir ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/DSP_Designs/dsp_mul_unsigned_comb/
verific -vlog-libext .v
verific -vlog-libext .sv
verific -vlog-define 
verific -vlog2k ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/DSP_Designs/dsp_mul_unsigned_comb/dsp_mul_unsigned_comb.sv
verific -import dsp_mul_unsigned_comb


# Technology mapping
hierarchy -top dsp_mul_unsigned_comb



plugin -i synth-rs

synth_rs -tech ${ARCHITECTURE} ${SYNTH_SETTING}
write_blif dsp_mul_unsigned_comb_post_synth.blif

  write_verilog -noexpr -nohex ${TOP}_post_synth.v
