 
# Yosys synthesis script for asym_ram_sdp_wide_sync_read
# Read source files
read -sv ./../../../../../yosys/install/share/yosys/rapidsilicon/genesis2/cell_sim_blackbox.v
verific -vlog-libext .v
verific -vlog-libext .sv
verific -vlog-define 
verific -vlog2k ./../../../../../RTL_Benchmark/Verilog/yosys_validation/EDA-863/asym_ram_sdp_wide_sync_read.sv
verific -import asym_ram_sdp_wide_sync_read


# Technology mapping
hierarchy -top asym_ram_sdp_wide_sync_read



plugin -i synth-rs

synth_rs  -tech genesis2 -top asym_ram_sdp_wide_sync_read -de -goal delay -carry no        -de_max_threads -1   

write_verilog -noattr -nohex  asym_ram_sdp_wide_sync_read_post_synth.v


  