 
# Yosys synthesis script for asym_ram_sdp_wide_sync_read
# Read source files
read_verilog -sv ${ROOT_PATH}/yosys/install/share/yosys/rapidsilicon/${ARCHITECTURE}/cell_sim_blackbox.v
read_verilog  -I${ROOT_PATH}/${RTL_PATH} ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/EDA-863/asym_ram_sdp_wide_sync_read.sv


# Technology mapping
hierarchy -top asym_ram_sdp_wide_sync_read



plugin -i synth-rs

synth_rs -tech ${ARCHITECTURE} ${SYNTH_SETTING}


  write_verilog -noexpr -nohex ${TOP}_post_synth.v
