 
# Yosys synthesis script for load_accum
# Read source files
read_verilog -sv ${ROOT_PATH}/yosys/install/share/yosys/rapidsilicon/${ARCHITECTURE}/cell_sim_blackbox.v
read_verilog  -I${ROOT_PATH}/${RTL_PATH} ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/DSP_Designs/load_accum/load_accum.sv


# Technology mapping
hierarchy -top load_accum



plugin -i synth-rs

synth_rs -tech ${SYNTH_SETTING}
write_blif load_accum_post_synth.blif

write_verilog -noexpr -nodec ${TOP}_post_synth.v
