read -sv ucsb_152_tap_fir.v

synth -flatten -top ucsb_152_tap_fir
#abc -lut 6
abc -script abc6.scr
opt_clean

#write_verilog netlist.v

stat

