 
# Yosys synthesis script for ram_true_dp_dc_4096x36
# Read source files
read_verilog  -I${ROOT_PATH}/${RTL_PATH} ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/EDA-869/ram_true_dp_dc_4096x36.sv


# Technology mapping
hierarchy -top ram_true_dp_dc_4096x36



plugin -i synth-rs

synth_rs -tech ${SYNTH_SETTING}
write_blif ram_true_dp_dc_4096x36_post_synth.blif

write_verilog -noexpr -nodec ${TOP}_post_synth.v
