 
# Yosys synthesis script for simple_multiplier_with_adder
# Read source files
read_verilog -sv ${ROOT_PATH}/yosys/install/share/yosys/rapidsilicon/${ARCHITECTURE}/cell_sim_blackbox.v
read_verilog  -I${ROOT_PATH}/${RTL_PATH} ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/DSP_Designs/simple_multiplier_with_adder/simple_multiplier_with_adder.sv


# Technology mapping
hierarchy -top simple_multiplier_with_adder



plugin -i synth-rs

synth_rs -tech ${ARCHITECTURE} ${SYNTH_SETTING}
write_blif simple_multiplier_with_adder_post_synth.blif

write_verilog -noexpr -nodec ${TOP}_post_synth.v
