 
# Yosys synthesis script for bytewrite_sdp_ram_nc
# Read source files
read_verilog -sv ${ROOT_PATH}/yosys/install/share/yosys/rapidsilicon/${ARCHITECTURE}/cell_sim_blackbox.v
read_verilog  -I${ROOT_PATH}/${RTL_PATH} ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/EDA-871/bytewrite_sdp_ram_nc_1024x28/bytewrite_sdp_ram_nc_1024x28.sv


# Technology mapping
hierarchy -top bytewrite_sdp_ram_nc_1024x28



plugin -i synth-rs

synth_rs -tech ${SYNTH_SETTING}
write_blif bytewrite_sdp_ram_nc_post_synth.blif

  
write_verilog -noexpr -nodec ${TOP}_post_synth.v
