 
# Yosys synthesis script for asym_ram_sdp_wide_write
# Read source files
read -sv ${ROOT_PATH}/yosys/install/share/yosys/rapidsilicon/${ARCHITECTURE}/cell_sim_blackbox.v
verific -vlog-libext .v
verific -vlog-libext .sv
verific -vlog-define 
verific -vlog2k ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/EDA-896/asym_ram_sdp_wide_write.sv
verific -import asym_ram_sdp_wide_write


# Technology mapping
hierarchy -top asym_ram_sdp_wide_write



plugin -i synth-rs

synth_rs  -tech ${ARCHITECTURE} -top asym_ram_sdp_wide_write -de -goal delay -carry no        -de_max_threads -1   

write_verilog -noexpr -nodec ${TOP}_post_synth.v
#write_blif asym_ram_sdp_wide_write_post_synth.blif

  