 
# Yosys synthesis script for asym_ram_sdp_wide_write
# Read source files
read -sv ${ROOT_PATH}/yosys/install/share/yosys/rapidsilicon/${ARCHITECTURE}/cell_sim_blackbox.v
verific -vlog-libext .v
verific -vlog-libext .sv
verific -vlog-define 
verific -vlog2k ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/EDA-896/asym_ram_sdp_wide_write.sv
verific -import asym_ram_sdp_wide_write


# Technology mapping
hierarchy -top asym_ram_sdp_wide_write



plugin -i synth-rs

synth_rs -tech ${ARCHITECTURE} ${SYNTH_SETTING}
#write_blif asym_ram_sdp_wide_write_post_synth.blif

  write_verilog -noexpr -nohex ${TOP}_post_synth.v
