
# Yosys synthesis script for mac_32
# Read source files
read_verilog -sv ${ROOT_PATH}/yosys/install/share/yosys/rapidsilicon/${ARCHITECTURE}/cell_sim_blackbox.v
read_verilog  -I${ROOT_PATH}/${RTL_PATH} ${ROOT_PATH}/${RTL_PATH}/mac_32.sv


# Technology mapping
hierarchy -top mac_32



plugin -i synth-rs

synth_rs -tech ${ARCHITECTURE} ${SYNTH_SETTING}

write_verilog -noexpr -nohex ${TOP}_post_synth.v
