 
echo on
# Yosys synthesis script for dsp_regin
# Read source files
read -sv ${ROOT_PATH}/yosys/install/share/yosys/rapidsilicon/${ARCHITECTURE}/cell_sim_blackbox.v
verific -vlog-libext .v
verific -vlog-libext .sv
verific -vlog-define 
verific -vlog2k ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/CASTORIP-151/dsp_regin.sv
verific -import dsp_regin


# Technology mapping
hierarchy -top dsp_regin



plugin -i synth-rs
logger -debug

synth_rs -tech ${ARCHITECTURE} ${SYNTH_SETTING}
write_blif dsp_regin_post_synth.blif

  
write_verilog -noexpr -nohex ${TOP}_post_synth.v
