 
# Yosys synthesis script for rams_sp_wf_1024x7
# Read source files
verific -vlog-incdir ./../../../../../RTL_Benchmark/Verilog/yosys_validation/SP_WF/
verific -vlog-libdir ./../../../../../RTL_Benchmark/Verilog/yosys_validation/SP_WF/
verific -vlog-libext .v
verific -vlog-libext .sv
verific -vlog-define 
verific -vlog2k ./../../../../../RTL_Benchmark/Verilog/yosys_validation/SP_WF/rams_sp_wf_1024x7.sv
verific -import rams_sp_wf_1024x7


# Technology mapping
hierarchy -top rams_sp_wf_1024x7



plugin -i synth-rs

synth_rs  -tech genesis2 -de -goal delay     -max_device_dsp 154 -max_device_bram 154      -de_max_threads -1   

write_verilog -noexpr -nodec -v rams_sp_wf_1024x7_post_synth.v