 
# Yosys synthesis script for bytewrite_sp_ram_wf
# Read source files
read_verilog -sv ${ROOT_PATH}/yosys/install/share/yosys/rapidsilicon/${ARCHITECTURE}/cell_sim_blackbox.v
read_verilog  -I${ROOT_PATH}/${RTL_PATH} ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/EDA-849/bytewrite_sp_ram_wf/bytewrite_sp_ram_wf.sv


# Technology mapping
hierarchy -top bytewrite_sp_ram_wf

plugin -i synth-rs

synth_rs -tech ${ARCHITECTURE} ${SYNTH_SETTING}
write_blif bytewrite_sp_ram_wf_post_synth.blif

  write_verilog -noexpr -nohex ${TOP}_post_synth.v
