 
# Yosys synthesis script for bytewrite_sp_ram_wf
# Read source files
read -sv ${ROOT_PATH}/yosys/install/share/yosys/rapidsilicon/${ARCHITECTURE}/cell_sim_blackbox.v
verific -vlog-incdir ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/EDA-849/bytewrite_sp_ram_wf/
verific -vlog-libdir ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/EDA-849/bytewrite_sp_ram_wf/
verific -vlog-libext .v
verific -vlog-libext .sv
verific -vlog-define 
verific -vlog2k ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/EDA-849/bytewrite_sp_ram_wf/bytewrite_sp_ram_wf.sv
verific -import bytewrite_sp_ram_wf


# Technology mapping
hierarchy -top bytewrite_sp_ram_wf

plugin -i synth-rs

synth_rs -tech ${ARCHITECTURE} ${SYNTH_SETTING}
write_blif bytewrite_sp_ram_wf_post_synth.blif

  write_verilog -noexpr -nohex ${TOP}_post_synth.v
