 
# Yosys synthesis script for signed_right_shift_a_input
# Read source files
read -sv ${ROOT_PATH}/yosys/install/share/yosys/rapidsilicon/${ARCHITECTURE}/cell_sim_blackbox.v
verific -vlog-incdir ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/EDA-1455/signed_right_shift_a_input/
verific -vlog-libdir ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/EDA-1455/signed_right_shift_a_input/
verific -vlog-libext .v
verific -vlog-libext .sv
verific -vlog-define 
verific -vlog2k ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/EDA-1455/signed_right_shift_a_input/signed_right_shift_a_input.sv
verific -import signed_right_shift_a_input


# Technology mapping
hierarchy -top signed_right_shift_a_input



plugin -i synth-rs

synth_rs -tech ${ARCHITECTURE} ${SYNTH_SETTING}
write_blif signed_right_shift_a_input_post_synth.blif

  write_verilog -noexpr -nohex ${TOP}_post_synth.v
