 
# Yosys synthesis script for bytewrite_sdp_ram_rf
# Read source files
read -sv ${ROOT_PATH}/yosys/install/share/yosys/rapidsilicon/${ARCHITECTURE}/cell_sim_blackbox.v
verific -vlog-incdir ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/ 
verific -vlog-libdir ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/
verific -vlog-libext .v
verific -vlog-libext .sv
verific -vlog-define 
verific -vlog2k ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/EDA-670/bytewrite_sdp_ram_rf.sv
verific -import bytewrite_sdp_ram_rf


# Technology mapping
hierarchy -top bytewrite_sdp_ram_rf



plugin -i synth-rs

synth_rs -tech ${ARCHITECTURE} ${SYNTH_SETTING}
write_blif bytewrite_sdp_ram_rf_post_synth.blif

  
write_verilog -noexpr -nohex ${TOP}_post_synth.v
