 
# Yosys synthesis script for two_sdp
# Read source files
read_verilog -sv ${ROOT_PATH}/yosys/install/share/yosys/rapidsilicon/${ARCHITECTURE}/cell_sim_blackbox.v
read_verilog  -I${ROOT_PATH}/${RTL_PATH} ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/EDA-1318/two_sdp.sv


# Technology mapping
hierarchy -top two_sdp



plugin -i synth-rs

synth_rs -tech ${ARCHITECTURE} ${SYNTH_SETTING}
#write_blif two_sdp_post_synth.blifwrite_verilog -noexpr -nohex ${TOP}_post_synth.v
write_verilog -noexpr -nohex ${TOP}_post_synth.v
