 
# Yosys synthesis script for two_sdp
# Read source files
read -sv ${ROOT_PATH}/yosys/install/share/yosys/rapidsilicon/${ARCHITECTURE}/cell_sim_blackbox.v
verific -vlog-libext .v
verific -vlog-libext .sv
verific -vlog-define 
verific -vlog2k ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/EDA-1318/two_sdp.sv
verific -import two_sdp


# Technology mapping
hierarchy -top two_sdp



plugin -i synth-rs

synth_rs -tech ${ARCHITECTURE} ${SYNTH_SETTING}
#write_blif two_sdp_post_synth.blifwrite_verilog -noexpr -nohex ${TOP}_post_synth.v
write_verilog -noexpr -nohex ${TOP}_post_synth.v
