 
# Yosys synthesis script for rams_sp_wf_readmem
# Read source files
read_verilog -sv ${ROOT_PATH}/yosys/install/share/yosys/rapidsilicon/${ARCHITECTURE}/cell_sim_blackbox.v
read_verilog  -I${ROOT_PATH}/${RTL_PATH} ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/Bram_Design_suite/rams_sp_wf_readmem/rams_sp_wf_readmem.sv


# Technology mapping
hierarchy -top rams_sp_wf_readmem



plugin -i synth-rs

synth_rs -tech ${SYNTH_SETTING}
# write_blif rams_sp_wf_readmem.blif

write_verilog -noexpr -nodec ${TOP}_post_synth.v
