 
# Yosys synthesis script for sp_init_re
# Read source files 
verific -vlog-libext .v
verific -vlog-libext .sv
verific -vlog-define 
verific -vlog2k ./../../../../../RTL_Benchmark/Verilog/yosys_validation/bram_tests/sp_init_re/sp_init_re.sv
verific -import sp_init_re


# Technology mapping
hierarchy -top sp_init_re


plugin -i synth-rs

synth_rs  -tech genesis2 -top sp_init_re -de -goal delay -carry no        -de_max_threads -1   

write_verilog -noexpr -nodec -norename sp_init_re_post_synth.v
write_blif sp_init_re_post_synth.blif

  
