
# Yosys synthesis script for dsp_multiplier_accum_with_add_neg
# Read source files
read_verilog -sv ${ROOT_PATH}/yosys/install/share/yosys/rapidsilicon/${ARCHITECTURE}/cell_sim_blackbox.v
read_verilog  -I${ROOT_PATH}/${RTL_PATH} ${ROOT_PATH}/${RTL_PATH}/dsp_multiplier_accum_with_add_neg.sv


# Technology mapping
hierarchy -top dsp_multiplier_accum_with_add_neg

plugin -i synth-rs

synth_rs -tech ${ARCHITECTURE} ${SYNTH_SETTING}
write_blif dsp_multiplier_accum_with_add_neg_post_synth.blif

write_verilog -noexpr -nodec ${TOP}_post_synth.v
