 
# Yosys synthesis script for dsp_multiplier_accum_with_add_neg
# Read source files
read -sv ${ROOT_PATH}/yosys/install/share/yosys/rapidsilicon/${ARCHITECTURE}/cell_sim_blackbox.v
verific -vlog-incdir ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/DSP_Designs/DSP_negative_edge_trigger_design/dsp_multiplier_accum_with_add_neg/
verific -vlog-libdir ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/DSP_Designs/DSP_negative_edge_trigger_design/dsp_multiplier_accum_with_add_neg/
verific -vlog-libext .v
verific -vlog-libext .sv
verific -vlog-define 
verific -vlog2k ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/DSP_Designs/DSP_negative_edge_trigger_design/dsp_multiplier_accum_with_add_neg/dsp_multiplier_accum_with_add_neg.sv
verific -import dsp_multiplier_accum_with_add_neg


# Technology mapping
hierarchy -top dsp_multiplier_accum_with_add_neg



plugin -i synth-rs

synth_rs -tech genesis3 -de -goal delay -no_iobuf -max_device_dsp 176 -max_device_bram 176 -max_device_carry_length 528 -max_dsp 176 -max_bram 176 -max_carry_length 528     -de_max_threads -1   

write_verilog -noexpr -nodec -v dsp_multiplier_accum_with_add_neg_post_synth.v
write_blif dsp_multiplier_accum_with_add_neg_post_synth.blif

  /nfs_scratch/scratch/FV/awais/Synthesis/yosys_verific_rs/RTL_Benchmark/Verilog/yosys_validation/DSP_Designs/DSP_negative_edge_trigger_design/dsp_multiplier_accum_with_add_neg/yosys.ys