 
# Yosys synthesis script for sp_arst_reg
# Read source files 
verific -vlog-libext .v
verific -vlog-libext .sv
verific -vlog-define 
verific -vlog2k ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/bram_tests/sp_arst_reg/sp_arst_reg.sv
verific -import sp_arst_reg


# Technology mapping
hierarchy -top sp_arst_reg


plugin -i synth-rs

synth_rs -tech ${ARCHITECTURE} ${SYNTH_SETTING}
write_blif sp_arst_reg_post_synth.blif

  
write_verilog -noexpr -nohex ${TOP}_post_synth.v
