 
# Yosys synthesis script for dsp_mul_signed_reg_with_accum
# Read source files
read -vlog2k ./../../../../../yosys/install/share/yosys/rapidsilicon/genesis2/cell_sim_blackbox.v
verific -vlog-incdir ./../../../../../RTL_Benchmark/Verilog/yosys_validation/EDA-348/Macc3/
verific -vlog-libdir ./../../../../../RTL_Benchmark/Verilog/yosys_validation/EDA-348/Macc3/
verific -vlog-define 
verific -vlog2k ./../../../../../RTL_Benchmark/Verilog/yosys_validation/EDA-348/Macc3/dsp_mul_signed_reg_with_accum.sv
verific -import dsp_mul_signed_reg_with_accum


# Technology mapping
hierarchy -top dsp_mul_signed_reg_with_accum



plugin -i synth-rs

synth_rs  -tech genesis2 -de -goal delay     -max_device_dsp 154 -max_device_bram 154      -de_max_threads -1   

write_verilog -noexpr -nodec -v dsp_mul_signed_reg_with_accum_post_synth.v
write_blif dsp_mul_signed_reg_with_accum_post_synth.blif

  