 
# Yosys synthesis script for ram_pipeline_block
# Read source files
read_verilog  -I${ROOT_PATH}/${RTL_PATH} ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/Bram_Design_suite/EDA-851/ram_pipeline_block.sv


# Technology mapping
hierarchy -top ram_pipeline_block



plugin -i synth-rs

synth_rs -tech ${SYNTH_SETTING}
write_blif ram_pipeline_block_post_synth.blif

write_verilog -noexpr -nodec ${TOP}_post_synth.v
