 
# Yosys synthesis script for design122_12_5_top
# Read source files
read_verilog -sv /nfs_eda_sw/softwares/Raptor/instl_dir/05_02_2024_09_15_01/share/raptor/sim_models/rapidsilicon/genesis3/FPGA_PRIMITIVES_MODELS/blackbox_models/cell_sim_blackbox.v
#read_verilog -sv full_adder_top.sv
#read_verilog -sv large_mux.sv
#read_verilog -sv register.sv
#read_verilog -sv memory_cntrl.sv
#read_verilog -sv encoder.sv
read_verilog -sv design122_12_5_top.sv 


# Technology mapping
hierarchy -top design122_12_5_top



plugin -i synth-rs

synth_rs -tech genesis3 -de -goal delay  -no_iobuf -effort high -carry auto   -new_dsp19x2 -new_tdp36k -max_lut 17472 -max_reg 34944 -max_device_dsp 56 -max_device_bram 56 -max_device_carry_length 336 -max_dsp 56 -max_bram 56 -max_carry_length 336  -fsm_encoding onehot   -de_max_threads -1   

write_verilog -noexpr -nodec -norename -v design122_12_5_top_post_synth.v
write_blif -param design122_12_5_top_post_synth.eblif



  