 
# Yosys synthesis script for dsp_fractured_accum_output_shifted_rounded
# Read source files
read -sv ${ROOT_PATH}/yosys/install/share/yosys/rapidsilicon/${ARCHITECTURE}/cell_sim_blackbox.v
verific -vlog-incdir ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/DSP_Designs/dsp_fractured_accum_output_shifted_rounded/
verific -vlog-libdir ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/DSP_Designs/dsp_fractured_accum_output_shifted_rounded/
verific -vlog-libext .v
verific -vlog-libext .sv
verific -vlog-define 
verific -vlog2k ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/DSP_Designs/dsp_fractured_accum_output_shifted_rounded/dsp_fractured_accum_output_shifted_rounded.sv
verific -import dsp_fractured_accum_output_shifted_rounded


# Technology mapping
hierarchy -top dsp_fractured_accum_output_shifted_rounded



plugin -i synth-rs

synth_rs  -tech ${ARCHITECTURE} -de -goal delay     -max_device_dsp 154 -max_device_bram 154    -de_max_threads -1   

write_verilog -noexpr -nodec ${TOP}_post_synth.v
write_blif dsp_fractured_accum_output_shifted_rounded_post_synth.blif

  