 
# Yosys synthesis script for ram_true_dp_dc_8192x16
# Read source files
read_verilog -sv ${ROOT_PATH}/yosys/install/share/yosys/rapidsilicon/${ARCHITECTURE}/cell_sim_blackbox.v
read_verilog  -I${ROOT_PATH}/${RTL_PATH} ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/Bram_Design_suite/EDA-1281/8192x18/ram_true_dp_dc_8192x18.sv


# Technology mapping
hierarchy -top ram_true_dp_dc_8192x18



plugin -i synth-rs

synth_rs -tech ${SYNTH_SETTING}
write_blif ram_true_dp_dc_8192x18_post_synth.blif

write_verilog -noexpr -nodec ${TOP}_post_synth.v
