 
# Yosys synthesis script for rams_sp_re_prio_we_rst_512x16_block
# Read source files
read_verilog -sv ${ROOT_PATH}/yosys/install/share/yosys/rapidsilicon/${ARCHITECTURE}/cell_sim_blackbox.v
read_verilog  -I${ROOT_PATH}/${RTL_PATH} ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/EDA-1459/rams_sp_re_prio_we_rst_512x16_block.sv


# Technology mapping
hierarchy -top rams_sp_re_prio_we_rst_512x16_block



plugin -i synth-rs

synth_rs -tech ${ARCHITECTURE} ${SYNTH_SETTING}
write_blif rams_sp_re_prio_we_rst_512x16_block_post_synth.blif

  write_verilog -noexpr -nohex ${TOP}_post_synth.v
