 
                             Library Compiler (TM)
                                 DesignWare (R)

               Version T-2022.03 for linux64 - Feb 22, 2022 -SLE

                    Copyright (c) 1988 - 2022 Synopsys, Inc.
   This software and the associated documentation are proprietary to Synopsys,
 Inc. This software may only be used in accordance with the terms and conditions
 of a written license agreement with Synopsys, Inc. All other use, reproduction,
   or distribution of this software is strictly prohibited.  Licensed Products
     communicate with Synopsys servers for the purpose of providing software
    updates, detecting software piracy and verifying that customers are using
    Licensed Products in conformity with the applicable License Key for such
  Licensed Products. Synopsys will use information gathered in connection with
    this process to deliver software updates and pursue software pirates and
                                   infringers.

 Inclusivity & Diversity - Visit SolvNetPlus to read the "Synopsys Statement on
            Inclusivity and Diversity" (Refer to article 000036315 at
                        https://solvnetplus.synopsys.com)

Initializing...
lc_shell> read_lib RC_OSC_50MHZ/RC_OSC_50MHZ_tc.lib
Reading '/home/ykim/Project/Gemini/RS_IPs/RC_OSC_50MHZ/RC_OSC_50MHZ_tc.lib' ...
Error: Line 143, Cell 'RC_OSC_50MHZ', pin 'RSTB', There is no 'VDDC' voltage_map defined for 'VDDC' voltage_name. (LBDB-848)
Error: Line 149, Cell 'RC_OSC_50MHZ', pin 'PD', There is no 'VDDC' voltage_map defined for 'VDDC' voltage_name. (LBDB-848)
Error: Line 172, Cell 'RC_OSC_50MHZ', pg_pin 'VDDC', There is no 'VDDC' voltage_map defined for 'VDDC' voltage_name. (LBDB-848)
Error: Line 172, Cell 'RC_OSC_50MHZ', pg_pin 'VDDC', An invalid attribute 'voltage_name' is found. (LBDB-27)
Error: Line 176, Cell 'RC_OSC_50MHZ', pg_pin 'VSS18', There is no 'VSS18' voltage_map defined for 'VSS18' voltage_name. (LBDB-848)
Error: Line 176, Cell 'RC_OSC_50MHZ', pg_pin 'VSS18', An invalid attribute 'voltage_name' is found. (LBDB-27)
Error: Line 180, Cell 'RC_OSC_50MHZ', pg_pin 'VDD18', There is no 'VDD18' voltage_map defined for 'VDD18' voltage_name. (LBDB-848)
Error: Line 180, Cell 'RC_OSC_50MHZ', pg_pin 'VDD18', An invalid attribute 'voltage_name' is found. (LBDB-27)
Error: Line 186, Cell 'RC_OSC_50MHZ', pin 'VR12', There is no 'VDD18' voltage_map defined for 'VDD18' voltage_name. (LBDB-848)
Error: Line 187, Cell 'RC_OSC_50MHZ', pin 'VR12', There is no 'VDD18' voltage_map defined for 'VDD18' voltage_name. (LBDB-848)
Error: Line 194, Cell 'RC_OSC_50MHZ', pin 'O_OSC', There is no 'VDDC' voltage_map defined for 'VDDC' voltage_name. (LBDB-848)
Warning: Line 184, Cell 'RC_OSC_50MHZ', pin 'VR12', The 'VR12' Pin/bus on the 'RC_OSC_50MHZ' cell has no 'function' attribute.
        The cell becomes a black box. (LIBG-16)
Warning: Line 192, Cell 'RC_OSC_50MHZ', pin 'O_OSC', The 'O_OSC' Pin/bus on the 'RC_OSC_50MHZ' cell has no 'function' attribute.
        The cell becomes a black box. (LIBG-16)
0
lc_shell> read_lib RC_OSC_50MHZ/RC_OSC_50MHZ_tc.lib
Reading '/home/ykim/Project/Gemini/RS_IPs/RC_OSC_50MHZ/RC_OSC_50MHZ_tc.lib' ...
Warning: Line 185, Cell 'RC_OSC_50MHZ', pin 'VR12', The 'VR12' Pin/bus on the 'RC_OSC_50MHZ' cell has no 'function' attribute.
        The cell becomes a black box. (LIBG-16)
Warning: Line 193, Cell 'RC_OSC_50MHZ', pin 'O_OSC', The 'O_OSC' Pin/bus on the 'RC_OSC_50MHZ' cell has no 'function' attribute.
        The cell becomes a black box. (LIBG-16)
Technology library 'RC_OSC_50MHZ_tc' read successfully
1
lc_shell> write_lib RC_OSC_50MHZ_tc -f db -o RC_OSC_50MHZ_tc.db
Wrote the 'RC_OSC_50MHZ_tc' library to '/home/ykim/Project/Gemini/RS_IPs/RC_OSC_50MHZ_tc.db' successfully
1
lc_shell> read_lib delay_line_64tap/delay_line_64tap_tc.lib
Error: The 'delay_line_64tap/delay_line_64tap_tc.lib' library source file is not found. (UIL-4)
0
lc_shell> read_lib delay_line_64tap/delay_line_tap64_tc.lib
Reading '/home/ykim/Project/Gemini/RS_IPs/delay_line_64tap/delay_line_tap64_tc.lib' ...
Error: Line 140, Cell 'delay_line_64tap', pin 'out', The '//' attribute/group name cannot be specified here. (LBDB-76)
Error: Line 145, /home/ykim/Project/Gemini/RS_IPs/delay_line_64tap/delay_line_tap64_tc.lib: syntax error on line 146 at or near '<EOF>'. (PARSE-1)
Error: Line 145, A syntax error is found before the library or phys_library group.
        The compilation is terminated. (LBDB-153)
0
lc_shell> read_lib delay_line_64tap/delay_line_tap64_tc.lib
Reading '/home/ykim/Project/Gemini/RS_IPs/delay_line_64tap/delay_line_tap64_tc.lib' ...
Warning: Line 108, Cell 'delay_line_64tap', pin 'in', The port 'in' does not have the attribute 'rise_capacitance_range' specified. The value (0.002000, 0.002000) will be assigned to the attribute. (LBDB-1054)
Warning: Line 108, Cell 'delay_line_64tap', pin 'in', The port 'in' does not have the attribute 'fall_capacitance_range' specified. The value (0.002000, 0.002000) will be assigned to the attribute. (LBDB-1054)
Warning: Line 108, Cell 'delay_line_64tap', pin 'in', The pin 'in' does not have a internal_power group. (LBDB-607)
Warning: Line 134, Cell 'delay_line_64tap', pin 'out', The pin 'out' does not have a internal_power group. (LBDB-607)
Warning: Line 134, Cell 'delay_line_64tap', pin 'out', The 'out' Pin/bus on the 'delay_line_64tap' cell has no 'function' attribute.
        The cell becomes a black box. (LIBG-16)
Technology library 'delay_line_64tap_tc' read successfully
1
lc_shell> read_lib delay_line_64tap/delay_line_tap64_tc.lib
Reading '/home/ykim/Project/Gemini/RS_IPs/delay_line_64tap/delay_line_tap64_tc.lib' ...
Warning: Line 108, Cell 'delay_line_64tap', pin 'in', The pin 'in' does not have a internal_power group. (LBDB-607)
Warning: Line 136, Cell 'delay_line_64tap', pin 'out', The pin 'out' does not have a internal_power group. (LBDB-607)
Warning: Line 136, Cell 'delay_line_64tap', pin 'out', The 'out' Pin/bus on the 'delay_line_64tap' cell has no 'function' attribute.
        The cell becomes a black box. (LIBG-16)
Warning: Overwriting an old technology library '/home/ykim/Project/Gemini/RS_IPs/delay_line_64tap/delay_line_64tap_tc.db' file with a new one. (UIL-2)
1
lc_shell> write_lib delay_line_tap64_tc -f db -o delay_line_tap64_tc.db
Warning: The 'delay_line_tap64_tc' library has not been read in yet. (UIL-3)
0
lc_shell> read_lib delay_line_64tap/delay_line_tap64_tc.lib
Reading '/home/ykim/Project/Gemini/RS_IPs/delay_line_64tap/delay_line_tap64_tc.lib' ...
Warning: Line 108, Cell 'delay_line_64tap', pin 'in', The pin 'in' does not have a internal_power group. (LBDB-607)
Warning: Line 136, Cell 'delay_line_64tap', pin 'out', The pin 'out' does not have a internal_power group. (LBDB-607)
Warning: Line 136, Cell 'delay_line_64tap', pin 'out', The 'out' Pin/bus on the 'delay_line_64tap' cell has no 'function' attribute.
        The cell becomes a black box. (LIBG-16)
Warning: Overwriting an old technology library '/home/ykim/Project/Gemini/RS_IPs/delay_line_64tap/delay_line_64tap_tc.db' file with a new one. (UIL-2)
1
lc_shell> write_lib delay_line_tap64_tc -f db -o delay_line_tap64/delay_line_tap64_tc.db
Warning: The 'delay_line_tap64_tc' library has not been read in yet. (UIL-3)
0
lc_shell> read_lib delay_line_64tap/delay_line_tap64_tc.lib
Error: The 'delay_line_64tap/delay_line_tap64_tc.lib' library source file is not found. (UIL-4)
0
lc_shell> read_lib delay_line_64tap/delay_line_64tap_tc.lib
Reading '/home/ykim/Project/Gemini/RS_IPs/delay_line_64tap/delay_line_64tap_tc.lib' ...
Warning: Line 108, Cell 'delay_line_64tap', pin 'in', The pin 'in' does not have a internal_power group. (LBDB-607)
Warning: Line 136, Cell 'delay_line_64tap', pin 'out', The pin 'out' does not have a internal_power group. (LBDB-607)
Warning: Line 136, Cell 'delay_line_64tap', pin 'out', The 'out' Pin/bus on the 'delay_line_64tap' cell has no 'function' attribute.
        The cell becomes a black box. (LIBG-16)
Warning: Overwriting an old technology library '/home/ykim/Project/Gemini/RS_IPs/delay_line_64tap/delay_line_64tap_tc.db' file with a new one. (UIL-2)
1
lc_shell> write_lib delay_line_64tap_tc -f db -o delay_line_64tap/delay_line_64tap_tc.db
Wrote the 'delay_line_64tap_tc' library to '/home/ykim/Project/Gemini/RS_IPs/delay_line_64tap/delay_line_64tap_tc.db' successfully
1
lc_shell> 
lc_shell> read_lib phase_gen_4_8_tc phase_gen_4_8_phase_sel_1_8/phase_gen_4_8_tc.lib
Error: extra positional option 'phase_gen_4_8_phase_sel_1_8/phase_gen_4_8_tc.lib' (CMD-012)
lc_shell> read_lib phase_gen_4_8_phase_sel_1_8/phase_gen_4_8_tc.lib
Reading '/home/ykim/Project/Gemini/RS_IPs/phase_gen_4_8_phase_sel_1_8/phase_gen_4_8_tc.lib' ...
Error: Line 173, Cell 'phase_gen_4_8', bus 'o_ph_clk', The '//' attribute/group name cannot be specified here. (LBDB-76)
Error: Line 178, /home/ykim/Project/Gemini/RS_IPs/phase_gen_4_8_phase_sel_1_8/phase_gen_4_8_tc.lib: syntax error on line 179 at or near '<EOF>'. (PARSE-1)
Error: Line 178, A syntax error is found before the library or phys_library group.
        The compilation is terminated. (LBDB-153)
0
lc_shell> read_lib phase_gen_4_8_phase_sel_1_8/phase_gen_4_8_tc.lib
Reading '/home/ykim/Project/Gemini/RS_IPs/phase_gen_4_8_phase_sel_1_8/phase_gen_4_8_tc.lib' ...
Warning: Line 134, Cell 'phase_gen_4_8', pin 'RESETB', The pin 'RESETB' does not have a internal_power group. (LBDB-607)
Warning: Line 141, Cell 'phase_gen_4_8', pin 'clk', The pin 'clk' does not have a internal_power group. (LBDB-607)
Warning: Line 148, Cell 'phase_gen_4_8', pin 'd41_d80', The pin 'd41_d80' does not have a internal_power group. (LBDB-607)
Warning: Line 166, Cell 'phase_gen_4_8', pin 'o_ph_clk[7]', The pin 'o_ph_clk[7]' does not have a internal_power group. (LBDB-607)
Warning: Line 166, Cell 'phase_gen_4_8', pin 'o_ph_clk[7]', The 'o_ph_clk[7]' Pin/bus on the 'phase_gen_4_8' cell has no 'function' attribute.
        The cell becomes a black box. (LIBG-16)
Warning: Line 127, Cell 'phase_gen_4_8', Failed to recognize the functionality of cell 'phase_gen_4_8'. (LIBG-10)
Technology library 'phase_gen_4_8_tc' read successfully
1
lc_shell> write_lib phase_gen_4_8_tc -f db -o phase_gen_4_8_phase_sel_1_8/phase_gen_4_8_tc.db
Wrote the 'phase_gen_4_8_tc' library to '/home/ykim/Project/Gemini/RS_IPs/phase_gen_4_8_phase_sel_1_8/phase_gen_4_8_tc.db' successfully
1
lc_shell> read_lib phase_gen_4_8_phase_sel_1_8/phase_sel_1_8_tc.lib
Reading '/home/ykim/Project/Gemini/RS_IPs/phase_gen_4_8_phase_sel_1_8/phase_sel_1_8_tc.lib' ...
Warning: Line 135, Cell 'phase_sel_1_8', pin 'RESETB', The pin 'RESETB' does not have a internal_power group. (LBDB-607)
Warning: Line 165, Cell 'phase_sel_1_8', pin 'o_sel_ph', The pin 'o_sel_ph' does not have a internal_power group. (LBDB-607)
Warning: Line 165, Cell 'phase_sel_1_8', pin 'o_sel_ph', The 'o_sel_ph' Pin/bus on the 'phase_sel_1_8' cell has no 'function' attribute.
        The cell becomes a black box. (LIBG-16)
Technology library 'phase_sel_1_8_tc' read successfully
1
lc_shell> write_lib phase_sel_1_8_tc -f db -o phase_gen_4_8_phase_sel_1_8/phase_sel_1_8_tc.db
Wrote the 'phase_sel_1_8_tc' library to '/home/ykim/Project/Gemini/RS_IPs/phase_gen_4_8_phase_sel_1_8/phase_sel_1_8_tc.db' successfully
1
lc_shell> 
lc_shell> quit
Maximum memory usage for this session: 108.21 MB
CPU usage for this session:      3 seconds (  0.00 hours)
Elapsed time for this session:   1679 seconds (  0.47 hours)
Thank you for using Library Compiler.

