read -sv systemcdes.v GSCLib_3.0.v

synth -flatten -top systemcdes

#abc -lut 6
#abc -script abc6.scr
abc -script abc_base6.v1.scr
opt_clean

#write_verilog netlist.v

stat

