 
# Yosys synthesis script for multiplier_adder_wrt_Reg_input_i
# Read source files
read_verilog -sv ${ROOT_PATH}/yosys/install/share/yosys/rapidsilicon/${ARCHITECTURE}/cell_sim_blackbox.v
read_verilog  -I${ROOT_PATH}/${RTL_PATH} ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/DSP_Designs/multiplier_adder_wrt_Reg_input_i/multiplier_adder_wrt_Reg_input_i.sv


# Technology mapping
hierarchy -top multiplier_adder_wrt_Reg_input_i



plugin -i synth-rs

synth_rs -tech ${ARCHITECTURE} ${SYNTH_SETTING}
write_blif multiplier_adder_wrt_Reg_input_i_post_synth.blif

  write_verilog -noexpr -nohex ${TOP}_post_synth.v
