 
# Yosys synthesis script for bytewrite_tdp_ram_wf
# Read source files
read_verilog  -I${ROOT_PATH}/${RTL_PATH} ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/EDA-1777/bytewrite_tdp_ram_wf.sv


# Technology mapping
hierarchy -top bytewrite_tdp_ram_wf



plugin -i synth-rs

synth_rs -tech ${ARCHITECTURE} ${SYNTH_SETTING}
write_verilog -noexpr -nohex ${TOP}_post_synth.v
