 
# Yosys synthesis script for rams_sp_reg_addr_1024x36
# Read source files
verific -vlog-libext .v
verific -vlog-libext .sv
verific -vlog-define 
verific -vlog2k ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/EDA-881/rams_sp_reg_addr_1024x36.sv
verific -import rams_sp_reg_addr_1024x36


# Technology mapping
hierarchy -top rams_sp_reg_addr_1024x36



plugin -i synth-rs

synth_rs -tech ${ARCHITECTURE} ${SYNTH_SETTING}
write_blif rams_sp_reg_addr_1024x36_post_synth.blif

  write_verilog -noexpr -nohex ${TOP}_post_synth.v
