 
# Yosys synthesis script for dsp_fractured_signed_mul_comb
# Read source files
read -vlog2k ./../../../../../yosys/install/share/yosys/rapidsilicon/genesis2/cell_sim_blackbox.v
verific -vlog-incdir ./../../../../../RTL_Benchmark/Verilog/yosys_validation/DSP_Designs/dsp_fractured_signed_mul_comb/
verific -vlog-libdir ./../../../../../RTL_Benchmark/Verilog/yosys_validation/DSP_Designs/dsp_fractured_signed_mul_comb/
verific -vlog-libext .v
verific -vlog-libext .sv
verific -vlog-define 
verific -vlog2k ./../../../../../RTL_Benchmark/Verilog/yosys_validation/DSP_Designs/dsp_fractured_signed_mul_comb/dsp_fractured_signed_mul_comb.sv
verific -import dsp_fractured_signed_mul_comb


# Technology mapping
hierarchy -top dsp_fractured_signed_mul_comb



plugin -i synth-rs

synth_rs  -tech genesis3 -de -goal delay     -max_device_dsp 154 -max_device_bram 154    -de_max_threads -1   

write_verilog -noexpr -nodec -v dsp_fractured_signed_mul_comb_post_synth.v
write_blif dsp_fractured_signed_mul_comb_post_synth.blif

  