 
# Yosys synthesis script for sync_sdp_wr_first_reg
# Read source files 
verific -vlog-libext .v
verific -vlog-libext .sv
verific -vlog-define 
verific -vlog2k ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/bram_tests/sync_sdp_wr_first_reg/sync_sdp_wr_first_reg.sv
verific -import sync_sdp_wr_first_reg


# Technology mapping
hierarchy -top sync_sdp_wr_first_reg


plugin -i synth-rs

synth_rs  -tech ${ARCHITECTURE} -top sync_sdp_wr_first_reg -de -goal delay -carry no        -de_max_threads -1   

write_verilog -noexpr -nodec -norename sync_sdp_wr_first_reg_post_synth.v
write_blif sync_sdp_wr_first_reg_post_synth.blif

  
