 
# Yosys synthesis script for sync_sdp_wr_first_reg
# Read source files 
verific -vlog-libext .v
verific -vlog-libext .sv
verific -vlog-define 
verific -vlog2k ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/bram_tests/sync_sdp_wr_first_reg/sync_sdp_wr_first_reg.sv
verific -import sync_sdp_wr_first_reg


# Technology mapping
hierarchy -top sync_sdp_wr_first_reg


plugin -i synth-rs

synth_rs -tech ${ARCHITECTURE} ${SYNTH_SETTING}
write_blif sync_sdp_wr_first_reg_post_synth.blif

  
write_verilog -noexpr -nohex ${TOP}_post_synth.v
