 
# Yosys synthesis script for SBox
# Read source files
read_verilog -sv ${ROOT_PATH}/yosys/install/share/yosys/rapidsilicon/${ARCHITECTURE}/cell_sim_blackbox.v
read_verilog  -I${ROOT_PATH}/${RTL_PATH} ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/EDA-2461/SBox.sv


# Technology mapping
hierarchy -top SBox



plugin -i synth-rs

synth_rs -tech ${SYNTH_SETTING}
# write_blif SBox.blif

write_verilog -noexpr -nodec ${TOP}_post_synth.v
