 
# Yosys synthesis script for ram_true_reg_addr_dp_1024x32_readmem
# Read source files
read_verilog -sv ${ROOT_PATH}/yosys/install/share/yosys/rapidsilicon/${ARCHITECTURE}/cell_sim_blackbox.v
read_verilog  -I${ROOT_PATH}/${RTL_PATH} ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/ram_true_reg_addr_dp_1024x32_readmem/ram_true_reg_addr_dp_1024x32_readmem.sv


# Technology mapping
hierarchy -top ram_true_reg_addr_dp_1024x32_readmem



plugin -i synth-rs

synth_rs -tech ${SYNTH_SETTING}
# write_blif ram_true_reg_addr_dp_1024x32_readmem.blif

write_verilog -noexpr -nodec ${TOP}_post_synth.v
