 
# Yosys synthesis script for add_shifted_input_to_the_mul_output_acc
# Read source files
read_verilog -sv ${ROOT_PATH}/yosys/install/share/yosys/rapidsilicon/${ARCHITECTURE}/cell_sim_blackbox.v
read_verilog  -I${ROOT_PATH}/${RTL_PATH} ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/EDA-1888/multadd_with_acc/add_shifted_input_to_the_mul_output.sv


# Technology mapping
hierarchy -top add_shifted_input_to_the_mul_output_acc



plugin -i synth-rs

synth_rs -tech ${ARCHITECTURE} ${SYNTH_SETTING}
write_blif add_shifted_input_to_the_mul_output_acc_post_synth.blif

  write_verilog -noexpr -nohex ${TOP}_post_synth.v
