 
# Yosys synthesis script for rams_sp_re_we_asynch_rst_1024x32
# Read source files
read_verilog -sv ${ROOT_PATH}/yosys/install/share/yosys/rapidsilicon/${ARCHITECTURE}/cell_sim_blackbox.v
read_verilog  -I${ROOT_PATH}/${RTL_PATH} ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/EDA-1769/rams_sp_re_we_asynch_rst_1024x32/rams_sp_re_we_asynch_rst_1024x32.sv


# Technology mapping
hierarchy -top rams_sp_re_we_asynch_rst_1024x32



plugin -i synth-rs

synth_rs -tech ${SYNTH_SETTING}
write_blif rams_sp_re_we_asynch_rst_1024x32_post_synth.blif

write_verilog -noexpr -nodec ${TOP}_post_synth.v
