 
# Yosys synthesis script for input_to_adder_and_mul_A_input_wrt_feedback_i
# Read source files
read_verilog -sv ${ROOT_PATH}/yosys/install/share/yosys/rapidsilicon/${ARCHITECTURE}/cell_sim_blackbox.v
read_verilog  -I${ROOT_PATH}/${RTL_PATH} ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/DSP_Designs/input_to_adder_and_mul_A_input_wrt_feedback_i/input_to_adder_and_mul_A_input_wrt_feedback_i.sv


# Technology mapping
hierarchy -top input_to_adder_and_mul_A_input_wrt_feedback_i



plugin -i synth-rs

synth_rs -tech ${ARCHITECTURE} ${SYNTH_SETTING}
write_blif input_to_adder_and_mul_A_input_wrt_feedback_i_post_synth.blif

  write_verilog -noexpr -nohex ${TOP}_post_synth.v
