 
# Yosys synthesis script for input_to_adder_and_mul_A_input_wrt_feedback_i
# Read source files
read -sv ${ROOT_PATH}/yosys/install/share/yosys/rapidsilicon/${ARCHITECTURE}/cell_sim_blackbox.v
verific -vlog-incdir ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/DSP_Designs/input_to_adder_and_mul_A_input_wrt_feedback_i/ 
verific -vlog-libdir ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/DSP_Designs/input_to_adder_and_mul_A_input_wrt_feedback_i/
verific -vlog-libext .v
verific -vlog-libext .sv
verific -vlog-define 
verific -vlog2k ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/DSP_Designs/input_to_adder_and_mul_A_input_wrt_feedback_i/input_to_adder_and_mul_A_input_wrt_feedback_i.sv
verific -import input_to_adder_and_mul_A_input_wrt_feedback_i


# Technology mapping
hierarchy -top input_to_adder_and_mul_A_input_wrt_feedback_i



plugin -i synth-rs

synth_rs  -tech ${ARCHITECTURE} -de -goal delay     -max_device_dsp 154 -max_device_bram 154    -de_max_threads -1   

write_verilog -noexpr -nodec -v input_to_adder_and_mul_A_input_wrt_feedback_i_post_synth.v
write_blif input_to_adder_and_mul_A_input_wrt_feedback_i_post_synth.blif

  