 
# Yosys synthesis script for sync_sdp_read_first
# Read source files 
read_verilog  -I${ROOT_PATH}/${RTL_PATH} ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/bram_tests/sync_sdp_read_first/sync_sdp_read_first.sv


# Technology mapping
hierarchy -top sync_sdp_read_first


plugin -i synth-rs

synth_rs -tech ${ARCHITECTURE} ${SYNTH_SETTING}
write_blif sync_sdp_read_first_post_synth.blif

  
write_verilog -noexpr -nodec ${TOP}_post_synth.v
