 
# Yosys synthesis script for sync_sdp_read_first
# Read source files 
verific -vlog-libext .v
verific -vlog-libext .sv
verific -vlog-define 
verific -vlog2k ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/bram_tests/sync_sdp_read_first/sync_sdp_read_first.sv
verific -import sync_sdp_read_first


# Technology mapping
hierarchy -top sync_sdp_read_first


plugin -i synth-rs

synth_rs -tech ${ARCHITECTURE} ${SYNTH_SETTING}
write_blif sync_sdp_read_first_post_synth.blif

  
write_verilog -noexpr -nohex ${TOP}_post_synth.v
