 
# Yosys synthesis script for async_read_sp
# Read source files 
verific -vlog-libext .v
verific -vlog-libext .sv
verific -vlog-define 
verific -vlog2k ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/bram_tests/async_read_sp/async_read_sp.sv
verific -import async_read_sp


# Technology mapping
hierarchy -top async_read_sp


plugin -i synth-rs

synth_rs -tech ${ARCHITECTURE} ${SYNTH_SETTING}
write_blif async_read_sp_post_synth.blif

  
write_verilog -noexpr -nohex ${TOP}_post_synth.v
