 
# Yosys synthesis script for async_read_sp
# Read source files 
read_verilog  -I${ROOT_PATH}/${RTL_PATH} ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/bram_tests/async_read_sp/async_read_sp.sv


# Technology mapping
hierarchy -top async_read_sp


plugin -i synth-rs

synth_rs -tech ${ARCHITECTURE} ${SYNTH_SETTING}
write_blif async_read_sp_post_synth.blif

  
write_verilog -noexpr -nodec ${TOP}_post_synth.v
