 
# Yosys synthesis script for sync_sp_be
# Read source files 
read_verilog  -I${ROOT_PATH}/${RTL_PATH} ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/Bram_Design_suite/bram_tests/sync_sp_be/sync_sp_be.sv


# Technology mapping
hierarchy -top sync_sp_be


plugin -i synth-rs

synth_rs -tech ${SYNTH_SETTING}
write_blif sync_sp_be_post_synth.blif

  
write_verilog -noexpr -nodec ${TOP}_post_synth.v
