 
# Yosys synthesis script for tdp_256x8
# Read source files
verific -vlog-libext .v
verific -vlog-libext .sv
verific -vlog-define 
verific -vlog2k ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/EDA-880/tdp_256x8.sv
verific -import tdp_256x8


# Technology mapping
hierarchy -top tdp_256x8



plugin -i synth-rs

synth_rs -tech ${ARCHITECTURE} ${SYNTH_SETTING}
write_blif tdp_256x8_post_synth.blif

  write_verilog -noexpr -nohex ${TOP}_post_synth.v
