 
# Yosys synthesis script for tdp_256x8
# Read source files
verific -vlog-libext .v
verific -vlog-libext .sv
verific -vlog-define 
verific -vlog2k ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/EDA-880/tdp_256x8.sv
verific -import tdp_256x8


# Technology mapping
hierarchy -top tdp_256x8



plugin -i synth-rs

synth_rs  -tech ${ARCHITECTURE} -top tdp_256x8 -de -goal delay -carry no        -de_max_threads -1   

write_verilog -noexpr -nodec -norename tdp_256x8_post_synth.v
write_blif tdp_256x8_post_synth.blif

  