 
# Yosys synthesis script for signed_accum_output_shifted_rounded_saturated_overflow_inst
# Read source files
read -sv ${ROOT_PATH}/yosys/install/share/yosys/rapidsilicon/${ARCHITECTURE}/cell_sim_blackbox.v
verific -vlog-incdir ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/EDA-1455/signed_accum_output_shifted_rounded_saturated_overflow_inst/
verific -vlog-libdir ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/EDA-1455/signed_accum_output_shifted_rounded_saturated_overflow_inst/
verific -vlog-libext .v
verific -vlog-libext .sv
verific -vlog-define 
verific -vlog2k ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/EDA-1455/signed_accum_output_shifted_rounded_saturated_overflow_inst/signed_accum_output_shifted_rounded_saturated_overflow_inst.sv
verific -import signed_accum_output_shifted_rounded_saturated_overflow_inst


# Technology mapping
hierarchy -top signed_accum_output_shifted_rounded_saturated_overflow_inst



plugin -i synth-rs

synth_rs -tech ${ARCHITECTURE} ${SYNTH_SETTING}
write_blif signed_accum_output_shifted_rounded_saturated_overflow_inst_post_synth.blif

  write_verilog -noexpr -nohex ${TOP}_post_synth.v
