 
# Yosys synthesis script for ram_simple_dp_synch_rf_1024x32
# Read source files
read -sv ${ROOT_PATH}/yosys/install/share/yosys/rapidsilicon/${ARCHITECTURE}/cell_sim_blackbox.v
verific -vlog-incdir ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/SDP_RF/
verific -vlog-libdir ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/SDP_RF/
verific -vlog-libext .v
verific -vlog-libext .sv
verific -vlog-define 
verific -vlog2k ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/SDP_RF/ram_simple_dp_synch_rf_1024x32.sv
verific -import ram_simple_dp_synch_rf_1024x32


# Technology mapping
hierarchy -top ram_simple_dp_synch_rf_1024x32



plugin -i synth-rs

synth_rs  -tech ${ARCHITECTURE} -de -goal delay     -max_device_dsp 154 -max_device_bram 154      -de_max_threads -1   

write_verilog -noexpr -nodec ${TOP}_post_synth.v
write_blif ram_simple_dp_synch_rf_1024x32_post_synth.blif

  