 
# Yosys synthesis script for ram_simple_dp_synch_rf_1024x32
# Read source files
read -vlog2k /nfs_eda_sw/softwares/Raptor/instl_dir/02_19_2023_09_15_01/share/raptor/sim_models/rapidsilicon/genesis2/cell_sim_blackbox.v
verific -vlog-incdir ./../../../../../RTL_Benchmark/Verilog/yosys_validation/SDP_RF/
verific -vlog-libdir ./../../../../../RTL_Benchmark/Verilog/yosys_validation/SDP_RF/
verific -vlog-libext .v
verific -vlog-libext .sv
verific -vlog-define 
verific -vlog2k ./../../../../../RTL_Benchmark/Verilog/yosys_validation/SDP_RF/ram_simple_dp_synch_rf_1024x32.sv
verific -import ram_simple_dp_synch_rf_1024x32


# Technology mapping
hierarchy -top ram_simple_dp_synch_rf_1024x32



plugin -i synth-rs

synth_rs  -tech genesis2 -de -goal delay     -max_device_dsp 154 -max_device_bram 154      -de_max_threads -1   

write_verilog -noexpr -nodec -v ram_simple_dp_synch_rf_1024x32_post_synth.v
write_blif ram_simple_dp_synch_rf_1024x32_post_synth.blif

  