 
# Yosys synthesis script for dsp_multiplier_accum_with_add
# Read source files
read -sv ${ROOT_PATH}/yosys/install/share/yosys/rapidsilicon/${ARCHITECTURE}/cell_sim_blackbox.v
verific -vlog-incdir ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/DSP_Designs/dsp_multiplier_accum_with_add/ 
verific -vlog-libdir ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/DSP_Designs/dsp_multiplier_accum_with_add/
verific -vlog-libext .v
verific -vlog-libext .sv
verific -vlog-define 
verific -vlog2k ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/DSP_Designs/dsp_multiplier_accum_with_add/dsp_multiplier_accum_with_add.sv
verific -import dsp_multiplier_accum_with_add


# Technology mapping
hierarchy -top dsp_multiplier_accum_with_add



plugin -i synth-rs

synth_rs -tech ${ARCHITECTURE} ${SYNTH_SETTING}
write_blif dsp_multiplier_accum_with_add_post_synth.blif

  write_verilog -noexpr -nohex ${TOP}_post_synth.v
