 
# Yosys synthesis script for dsp_mult_accum_input_output_registered_inf_dsp19x2
# Read source files
read_verilog -sv ${ROOT_PATH}/yosys/install/share/yosys/rapidsilicon/${ARCHITECTURE}/cell_sim_blackbox.v
read_verilog  -I${ROOT_PATH}/${RTL_PATH} ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/DSP_Designs/DSP19X2_designs/dsp_mult_accum_input_output_registered_inf_dsp19x2/dsp_mult_accum_input_output_registered_inf_dsp19x2.sv


# Technology mapping
hierarchy -top dsp_mult_accum_input_output_registered_inf_dsp19x2



plugin -i synth-rs

synth_rs -tech ${SYNTH_SETTING} -new_dsp19x2
write_blif dsp_mult_accum_input_output_registered_inf_dsp19x2_post_synth.blif

write_verilog -noexpr -nodec ${TOP}_post_synth.v
