 
# Yosys synthesis script for sync_big_sdp
# Read source files 
verific -vlog-libext .v
verific -vlog-libext .sv
verific -vlog-define 
verific -vlog2k ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/bram_tests/sync_big_sdp/sync_big_sdp.sv
verific -import sync_big_sdp


# Technology mapping
hierarchy -top sync_big_sdp


plugin -i synth-rs

synth_rs  -tech ${ARCHITECTURE} -top sync_big_sdp -de -goal delay -carry no        -de_max_threads -1   

write_verilog -noexpr -nodec ${TOP}_post_synth.v
write_blif sync_big_sdp_post_synth.blif

  
