 
# Yosys synthesis script for accum_output_shifted_rounded_inst
# Read source files
read_verilog -sv ${ROOT_PATH}/yosys/install/share/yosys/rapidsilicon/${ARCHITECTURE}/cell_sim_blackbox.v
read_verilog  -I${ROOT_PATH}/${RTL_PATH} ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/EDA-1455/accum_output_shifted_rounded_inst/accum_output_shifted_rounded_inst.sv


# Technology mapping
hierarchy -top accum_output_shifted_rounded_inst



plugin -i synth-rs

synth_rs -tech ${SYNTH_SETTING}
write_blif accum_output_shifted_rounded_inst_post_synth.blif

write_verilog -noexpr -nodec ${TOP}_post_synth.v
