 
# Yosys synthesis script for bytewrite_sp_ram_wf_block
# Read source files
verific -vlog-incdir ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/EDA-1776/
verific -vlog-libdir ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/EDA-1776/
verific -vlog-libext .v
verific -vlog-libext .sv
verific -vlog-define 
verific -vlog2k ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/EDA-1776/bytewrite_sp_ram_wf_block.sv
verific -import bytewrite_sp_ram_wf_block


# Technology mapping
hierarchy -top bytewrite_sp_ram_wf_block



plugin -i synth-rs

synth_rs -tech ${ARCHITECTURE} ${SYNTH_SETTING}
write_verilog -noexpr -nohex ${TOP}_post_synth.v
