 
# Yosys synthesis script for sp_arst_reg
# Read source files 
read_verilog  -I${ROOT_PATH}/${RTL_PATH} ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/Bram_Design_suite/bram_tests/sp_arst_reg/sp_arst_reg.sv


# Technology mapping
hierarchy -top sp_arst_reg


plugin -i synth-rs

synth_rs -tech ${SYNTH_SETTING}
write_blif sp_arst_reg_post_synth.blif

  
write_verilog -noexpr -nodec ${TOP}_post_synth.v
