 
# Yosys synthesis script for dsp_mul_signed_reg_active_low_async_reset
# Read source files
read -sv ./../../../../../yosys/install/share/yosys/rapidsilicon/genesis2/cell_sim_blackbox.v
verific -vlog-incdir ./../../../../../RTL_Benchmark/Verilog/yosys_validation/EDA-1279/ 
verific -vlog-libdir ./../../../../../RTL_Benchmark/Verilog/yosys_validation/EDA-1279/ 
verific -vlog-libext .v
verific -vlog-libext .sv
verific -vlog-define 
verific -vlog2k ./../../../../../RTL_Benchmark/Verilog/yosys_validation/EDA-1279/dsp_mul_signed_reg_active_low_async_reset.sv
verific -import dsp_mul_signed_reg_active_low_async_reset


# Technology mapping
hierarchy -top dsp_mul_signed_reg_active_low_async_reset



plugin -i synth-rs

synth_rs  -tech genesis2 -de -goal delay     -max_device_dsp 154 -max_device_bram 154    -de_max_threads -1   

write_verilog -noexpr -nodec -v dsp_mul_signed_reg_active_low_async_reset_post_synth.v
# write_blif dsp_mul_signed_reg_active_low_async_reset_post_synth.blif

  