 
# Yosys synthesis script for dsp_mul_complex_eq
# Read source files
read -sv ./../../../../../yosys/install/share/yosys/rapidsilicon/genesis2/cell_sim_blackbox.v
verific -vlog-incdir ./../../../../../RTL_Benchmark/Verilog/yosys_validation/DSP_Designs/dsp_mul_complex_eq/ 
verific -vlog-libdir ./../../../../../RTL_Benchmark/Verilog/yosys_validation/DSP_Designs/dsp_mul_complex_eq/
verific -vlog-libext .v
verific -vlog-libext .sv
verific -vlog-define 
verific -vlog2k ./../../../../../RTL_Benchmark/Verilog/yosys_validation/DSP_Designs/dsp_mul_complex_eq/dsp_mul_complex_eq.sv
verific -import dsp_mul_complex_eq


# Technology mapping
hierarchy -top dsp_mul_complex_eq



plugin -i synth-rs

synth_rs  -tech genesis2 -de -goal delay     -max_device_dsp 154 -max_device_bram 154    -de_max_threads -1   

write_verilog -noexpr -nodec -v dsp_mul_complex_eq_post_synth.v
write_blif dsp_mul_complex_eq_post_synth.blif

  