 
# Yosys synthesis script for dsp_mul_complex_eq
# Read source files
read_verilog -sv ${ROOT_PATH}/yosys/install/share/yosys/rapidsilicon/${ARCHITECTURE}/cell_sim_blackbox.v
read_verilog  -I${ROOT_PATH}/${RTL_PATH} ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/DSP_Designs/dsp_mul_complex_eq/dsp_mul_complex_eq.sv


# Technology mapping
hierarchy -top dsp_mul_complex_eq



plugin -i synth-rs

synth_rs -tech ${SYNTH_SETTING}
write_blif dsp_mul_complex_eq_post_synth.blif

write_verilog -noexpr -nodec ${TOP}_post_synth.v
