 
# Yosys synthesis script for ram_true_dp_wf_1024x32
# Read source files
read_verilog -sv ${ROOT_PATH}/yosys/install/share/yosys/rapidsilicon/${ARCHITECTURE}/cell_sim_blackbox.v
read_verilog  -I${ROOT_PATH}/${RTL_PATH} ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/EDA-887/ram_true_dp_wf_1024x32.sv


# Technology mapping
hierarchy -top ram_true_dp_wf_1024x32



plugin -i synth-rs

synth_rs -tech ${ARCHITECTURE} ${SYNTH_SETTING}
#write_blif ram_true_dp_wf_1024x32_post_synth.blif

  write_verilog -noexpr -nohex ${TOP}_post_synth.v
