read -sv VexRiscv.v

abc -script abc_base6.v1.scr
synth_xilinx -flatten -top VexRiscv
#abc -lut 6
#abc -script abc6.scr
#abc -script abc_base6.v1.scr
opt_clean

#write_verilog netlist.v

stat

