 
# Yosys synthesis script for ram_true_dp_dc_8192x16
# Read source files
read -sv ${ROOT_PATH}/yosys/install/share/yosys/rapidsilicon/${ARCHITECTURE}/cell_sim_blackbox.v
verific -vlog-incdir ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/EDA-1281/8192x16/
verific -vlog-libdir ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/EDA-1281/8192x16/
verific -vlog-libext .v
verific -vlog-libext .sv
verific -vlog-define 
verific -vlog2k ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/EDA-1281/8192x18/ram_true_dp_dc_8192x18.sv
verific -import ram_true_dp_dc_8192x18


# Technology mapping
hierarchy -top ram_true_dp_dc_8192x18



plugin -i synth-rs

synth_rs -tech ${ARCHITECTURE} ${SYNTH_SETTING}
write_blif ram_true_dp_dc_8192x18_post_synth.blif

  write_verilog -noexpr -nohex ${TOP}_post_synth.v
