 
# Yosys synthesis script for reg_and_not_reg_input_mul_with_accum
# Read source files
read -sv ${ROOT_PATH}/yosys/install/share/yosys/rapidsilicon/${ARCHITECTURE}/cell_sim_blackbox.v
verific -vlog-incdir ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/DSP_Designs/reg_and_not_reg_input_mul_with_accum/ 
verific -vlog-libdir ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/DSP_Designs/reg_and_not_reg_input_mul_with_accum/
verific -vlog-libext .v
verific -vlog-libext .sv
verific -vlog-define 
verific -vlog2k ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/DSP_Designs/reg_and_not_reg_input_mul_with_accum/reg_and_not_reg_input_mul_with_accum.sv
verific -import reg_and_not_reg_input_mul_with_accum


# Technology mapping
hierarchy -top reg_and_not_reg_input_mul_with_accum



plugin -i synth-rs

synth_rs -tech ${ARCHITECTURE} ${SYNTH_SETTING}
write_blif reg_and_not_reg_input_mul_with_accum_post_synth.blif

  write_verilog -noexpr -nohex ${TOP}_post_synth.v
