 
# Yosys synthesis script for ram_pipeline_block
# Read source files
verific -vlog-libext .v
verific -vlog-libext .sv
verific -vlog-define 
verific -vlog2k ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/EDA-851/ram_pipeline_block.sv
verific -import ram_pipeline_block


# Technology mapping
hierarchy -top ram_pipeline_block



plugin -i synth-rs

synth_rs -tech ${ARCHITECTURE} ${SYNTH_SETTING}
write_blif ram_pipeline_block_post_synth.blif

  write_verilog -noexpr -nohex ${TOP}_post_synth.v
