 
# Yosys synthesis script for asym_ram_sdp_write_wider_dc_logic
# Read source files
read -sv ${ROOT_PATH}/yosys/install/share/yosys/rapidsilicon/${ARCHITECTURE}/cell_sim_blackbox.v
verific -vlog-libext .v
verific -vlog-libext .sv
verific -vlog-define 
verific -vlog2k ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/EDA-1046-logic/asym_ram_sdp_write_wider_dc_logic.sv
verific -import asym_ram_sdp_write_wider_dc_logic


# Technology mapping
hierarchy -top asym_ram_sdp_write_wider_dc_logic



plugin -i synth-rs

synth_rs  -tech ${ARCHITECTURE} -de -goal delay     -max_device_dsp 154 -max_device_bram 154      -de_max_threads -1   

write_verilog -noattr -nohex asym_ram_sdp_write_wider_dc_logic_post_synth.v


  