 
# Yosys synthesis script for signed_accum_output_shifted
# Read source files
read -sv ${ROOT_PATH}/yosys/install/share/yosys/rapidsilicon/${ARCHITECTURE}/cell_sim_blackbox.v
verific -vlog-incdir ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/EDA-1455/signed_accum_output_shifted/
verific -vlog-libdir ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/EDA-1455/signed_accum_output_shifted/
verific -vlog-libext .v
verific -vlog-libext .sv
verific -vlog-define 
verific -vlog2k ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/EDA-1455/signed_accum_output_shifted/signed_accum_output_shifted.sv
verific -import signed_accum_output_shifted


# Technology mapping
hierarchy -top signed_accum_output_shifted



plugin -i synth-rs

synth_rs  -tech ${ARCHITECTURE} -de -goal delay     -max_device_dsp 154 -max_device_bram 154 -max_dsp 154 -max_bram 154    -de_max_threads -1   

write_verilog -noexpr -nodec ${TOP}_post_synth.v
write_blif signed_accum_output_shifted_post_synth.blif

  