 
# Yosys synthesis script for dsp_mul_signed_reg_with_accum
# Read source files
read -sv ${ROOT_PATH}/yosys/install/share/yosys/rapidsilicon/${ARCHITECTURE}/cell_sim_blackbox.v
verific -vlog-incdir ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/EDA-348/Macc2/
verific -vlog-libdir ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/EDA-348/Macc2/
verific -vlog-define 
verific -vlog2k ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/EDA-348/Macc2/dsp_mul_signed_reg_with_accum.sv
verific -import dsp_mul_signed_reg_with_accum


# Technology mapping
hierarchy -top dsp_mul_signed_reg_with_accum



plugin -i synth-rs

synth_rs -tech ${ARCHITECTURE} ${SYNTH_SETTING}
write_blif dsp_mul_signed_reg_with_accum_post_synth.blif

  write_verilog -noexpr -nohex ${TOP}_post_synth.v
