 
# Yosys synthesis script for simple_unsigned_4tap_fir
# Read source files
read_verilog -sv ${ROOT_PATH}/yosys/install/share/yosys/rapidsilicon/${ARCHITECTURE}/cell_sim_blackbox.v
read_verilog  -I${ROOT_PATH}/${RTL_PATH} ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/DSP_Designs/simple_unsigned_4tap_fir/simple_unsigned_4tap_fir.sv


# Technology mapping
hierarchy -top simple_unsigned_4tap_fir



plugin -i synth-rs

synth_rs -tech ${ARCHITECTURE} ${SYNTH_SETTING}
write_blif simple_unsigned_4tap_fir_post_synth.blif

write_verilog -noexpr -nodec ${TOP}_post_synth.v
