 
echo on
# Yosys synthesis script for mac_32_arst
# Read source files
read_verilog -sv ${ROOT_PATH}/yosys/install/share/yosys/rapidsilicon/${ARCHITECTURE}/cell_sim_blackbox.v
read_verilog  -I${ROOT_PATH}/${RTL_PATH} ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/DSP_Designs/CASTORIP-150/mac_32_arst.sv


# Technology mapping
hierarchy -top mac_32_arst



plugin -i synth-rs
logger -debug

synth_rs -tech ${SYNTH_SETTING}
write_blif mac_32_arst_post_synth.blif

  
write_verilog -noexpr -nodec ${TOP}_post_synth.v
