 
# Yosys synthesis script for async_big_block
# Read source files 
read_verilog  -I${ROOT_PATH}/${RTL_PATH} ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/bram_tests/async_big_block/async_big_block.sv


# Technology mapping
hierarchy -top async_big_block


plugin -i synth-rs

synth_rs -tech ${ARCHITECTURE} ${SYNTH_SETTING}
write_blif async_big_block_post_synth.blif

  
write_verilog -noexpr -nodec ${TOP}_post_synth.v
