 
echo on
# Yosys synthesis script for mac_32_arst
# Read source files
read -sv ${ROOT_PATH}/yosys/install/share/yosys/rapidsilicon/${ARCHITECTURE}/cell_sim_blackbox.v
verific -vlog-libext .v
verific -vlog-libext .sv
verific -vlog-define 
verific -vlog2k ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/CASTORIP-150/mac_32_arst.sv
verific -import mac_32_arst


# Technology mapping
hierarchy -top mac_32_arst



plugin -i synth-rs
logger -debug

synth_rs  -tech ${ARCHITECTURE} -top mac_32_arst -de -goal delay -carry no -de_max_threads -1   

write_verilog -noexpr -nodec -norename mac_32_arst_post_synth.v
write_blif mac_32_arst_post_synth.blif

  
