 
echo on
# Yosys synthesis script for tdp_100x11
# Read source files
read_verilog -sv ${ROOT_PATH}/yosys/install/share/yosys/rapidsilicon/${ARCHITECTURE}/cell_sim_blackbox.v
read_verilog  -I${ROOT_PATH}/${RTL_PATH} ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/tdp_100x11_block/tdp_100x11.sv


# Technology mapping
hierarchy -top tdp_100x11



plugin -i synth-rs
logger -debug

synth_rs -tech ${SYNTH_SETTING}
write_blif dsp_regin_post_synth.blif

  
write_verilog -noexpr -nodec ${TOP}_post_synth.v