 
# Yosys synthesis script for bytewrite_sp_ram_wf
# Read source files
read -sv ${ROOT_PATH}/yosys/install/share/yosys/rapidsilicon/${ARCHITECTURE}/cell_sim_blackbox.v
verific -vlog-incdir ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/ 
verific -vlog-libdir ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/
verific -vlog-libext .v
verific -vlog-libext .sv
verific -vlog-define 
verific -vlog2k ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/EDA-893/bytewrite_sp_ram_wf.sv
verific -import bytewrite_sp_ram_wf


# Technology mapping
hierarchy -top bytewrite_sp_ram_wf



plugin -i synth-rs

synth_rs  -tech ${ARCHITECTURE} -de -goal delay     -max_device_dsp 154 -max_device_bram 154      -de_max_threads -1   

write_verilog -noexpr -nodec -v bytewrite_sp_ram_wf_post_synth.v
#write_blif bytewrite_sp_ram_wf_post_synth.blif

  
