 
# Yosys synthesis script for sp_new_rdwr
# Read source files 
verific -vlog-libext .v
verific -vlog-libext .sv
verific -vlog-define 
verific -vlog2k ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/bram_tests/sp_new_rdwr/sp_new_rdwr.sv
verific -import sp_new_rdwr


# Technology mapping
hierarchy -top sp_new_rdwr


plugin -i synth-rs

synth_rs -tech ${ARCHITECTURE} ${SYNTH_SETTING}
write_blif sp_new_rdwr_post_synth.blif

  
write_verilog -noexpr -nohex ${TOP}_post_synth.v
