 
# Yosys synthesis script for ram_true_dp_rf_1024x32
# Read source files
verific -vlog-libext .v
verific -vlog-libext .sv
verific -vlog-define 
verific -vlog2k ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/EDA-806/ram_true_dp_rf_1024x32.sv
verific -import ram_true_dp_rf_1024x32


# Technology mapping
hierarchy -top ram_true_dp_rf_1024x32



plugin -i synth-rs

synth_rs  -tech ${ARCHITECTURE} -top ram_true_dp_rf_1024x32 -de -goal delay -de_max_threads -1   

write_verilog -noexpr -nodec ${TOP}_post_synth.v
write_blif ram_true_dp_rf_1024x32_post_synth.blif

  