 
# Yosys synthesis script for asym_ram_sdp_write_wider
# Read source files
read -sv ${ROOT_PATH}/yosys/install/share/yosys/rapidsilicon/${ARCHITECTURE}/cell_sim_blackbox.v
verific -vlog-libext .v
verific -vlog-libext .sv
verific -vlog-define 
verific -vlog2k ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/EDA-1046/asym_ram_sdp_write_wider.sv
verific -import asym_ram_sdp_write_wider


# Technology mapping
hierarchy -top asym_ram_sdp_write_wider



plugin -i synth-rs

synth_rs -tech ${ARCHITECTURE} ${SYNTH_SETTING}


  write_verilog -noexpr -nohex ${TOP}_post_synth.v
