 
# Yosys synthesis script for dsp_mul_signed_reg_with_accum
# Read source files
read -sv ${ROOT_PATH}/yosys/install/share/yosys/rapidsilicon/${ARCHITECTURE}/cell_sim_blackbox.v
verific -vlog-incdir ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/DSP_Designs/dsp_mul_signed_reg_with_accum/ 
verific -vlog-libdir ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/DSP_Designs/dsp_mul_signed_reg_with_accum/
verific -vlog-libext .v
verific -vlog-libext .sv
verific -vlog-define 
verific -vlog2k ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/DSP_Designs/dsp_mul_signed_reg_with_accum/dsp_mul_signed_reg_with_accum.sv
verific -import dsp_mul_signed_reg_with_accum


# Technology mapping
hierarchy -top dsp_mul_signed_reg_with_accum



plugin -i synth-rs

synth_rs  -tech ${ARCHITECTURE} -de -goal delay     -max_device_dsp 154 -max_device_bram 154    -de_max_threads -1   

write_verilog -noexpr -nodec ${TOP}_post_synth.v
write_blif dsp_mul_signed_reg_with_accum_post_synth.blif

  