 
# Yosys synthesis script for dsp_eight_mult
# Read source files
read_verilog -sv ${ROOT_PATH}/yosys/install/share/yosys/rapidsilicon/${ARCHITECTURE}/cell_sim_blackbox.v
read_verilog  -I${ROOT_PATH}/${RTL_PATH} ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/DSP_Designs/dsp_eight_mult/dsp_eight_mult.sv


# Technology mapping
hierarchy -top dsp_eight_mult



plugin -i synth-rs

synth_rs -tech ${ARCHITECTURE} ${SYNTH_SETTING}
write_blif dsp_eight_mult_post_synth.blif

  write_verilog -noexpr -nohex ${TOP}_post_synth.v
