 
# Yosys synthesis script for sync_sdp_wr_first_reg
# Read source files 
read_verilog  -I${ROOT_PATH}/${RTL_PATH} ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/Bram_Design_suite/bram_tests/sync_sdp_wr_first_reg/sync_sdp_wr_first_reg.sv


# Technology mapping
hierarchy -top sync_sdp_wr_first_reg


plugin -i synth-rs

synth_rs -tech ${SYNTH_SETTING}
write_blif sync_sdp_wr_first_reg_post_synth.blif

  
write_verilog -noexpr -nodec ${TOP}_post_synth.v
