 
# Yosys synthesis script for dsp_mul_unsigned_parameterized
# Read source files
read -sv ${ROOT_PATH}/yosys/install/share/yosys/rapidsilicon/${ARCHITECTURE}/cell_sim_blackbox.v
verific -vlog-incdir ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/DSP_Designs/dsp_mul_unsigned_parameterized/ 
verific -vlog-libdir ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/DSP_Designs/dsp_mul_unsigned_parameterized/
verific -vlog-libext .v
verific -vlog-libext .sv
verific -vlog-define 
verific -vlog2k ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/DSP_Designs/dsp_mul_unsigned_parameterized/dsp_mul_unsigned_parameterized.sv
verific -import dsp_mul_unsigned_parameterized


# Technology mapping
hierarchy -top dsp_mul_unsigned_parameterized



plugin -i synth-rs

synth_rs  -tech ${ARCHITECTURE} -de -goal delay     -max_device_dsp 154 -max_device_bram 154    -de_max_threads -1   

write_verilog -noexpr -nodec -v dsp_mul_unsigned_parameterized_post_synth.v
write_blif dsp_mul_unsigned_parameterized_post_synth.blif

  