 
# Yosys synthesis script for sp_new_rdwr
# Read source files 
read_verilog  -I${ROOT_PATH}/${RTL_PATH} ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/Bram_Design_suite/bram_tests/sp_new_rdwr/sp_new_rdwr.sv


# Technology mapping
hierarchy -top sp_new_rdwr


plugin -i synth-rs

synth_rs -tech ${SYNTH_SETTING}
write_blif sp_new_rdwr_post_synth.blif

  
write_verilog -noexpr -nodec ${TOP}_post_synth.v
