 
# Yosys synthesis script for sixteen_mult_accum
# Read source files
read -sv ${ROOT_PATH}/yosys/install/share/yosys/rapidsilicon/${ARCHITECTURE}/cell_sim_blackbox.v
verific -vlog-incdir ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/DSP_Designs/sixteen_mult_accum/ 
verific -vlog-libdir ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/DSP_Designs/sixteen_mult_accum/
verific -vlog-libext .v
verific -vlog-libext .sv
verific -vlog-define 
verific -vlog2k ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/DSP_Designs/sixteen_mult_accum/sixteen_mult_accum.sv
verific -import sixteen_mult_accum


# Technology mapping
hierarchy -top sixteen_mult_accum



plugin -i synth-rs

synth_rs -tech ${ARCHITECTURE} ${SYNTH_SETTING}
write_blif sixteen_mult_accum_post_synth.blif

  write_verilog -noexpr -nohex ${TOP}_post_synth.v
