 
# Yosys synthesis script for sixteen_mult_accum
# Read source files
read_verilog -sv ${ROOT_PATH}/yosys/install/share/yosys/rapidsilicon/${ARCHITECTURE}/cell_sim_blackbox.v
read_verilog  -I${ROOT_PATH}/${RTL_PATH} ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/DSP_Designs/sixteen_mult_accum/sixteen_mult_accum.sv


# Technology mapping
hierarchy -top sixteen_mult_accum



plugin -i synth-rs

synth_rs -tech ${ARCHITECTURE} ${SYNTH_SETTING}
write_blif sixteen_mult_accum_post_synth.blif

write_verilog -noexpr -nodec ${TOP}_post_synth.v
