 
# Yosys synthesis script for rams_sp_reg_addr_1024x32
# Read source files

verific -vlog-libext .v
verific -vlog-libext .sv
verific -vlog-define 
verific -vlog2k ${ROOT_PATH}/RTL_Benchmark/Verilog/yosys_validation/EDA-402/EDA-402-hameed/rams_sp_reg_addr_1024x32.sv
verific -import rams_sp_reg_addr_1024x32


# Technology mapping
hierarchy -top rams_sp_reg_addr_1024x32



plugin -i synth-rs

synth_rs  -tech ${ARCHITECTURE} -top rams_sp_reg_addr_1024x32 -de -goal delay -carry no -de_max_threads -1

write_verilog -noexpr -nodec ${TOP}_post_synth.v
write_blif rams_sp_reg_addr_1024x32_post_synth.blif

  